[
    {
        "id": "712.0171",
        "title": "A Spectral Approach to Analyzing Belief Propagation for 3-Coloring",
        "abstract": "  Contributing to the rigorous understanding of BP, in this paper we relate the\nconvergence of BP to spectral properties of the graph. This encompasses a\nresult for random graphs with a ``planted'' solution; thus, we obtain the first\nrigorous result on BP for graph coloring in the case of a complex graphical\nstructure (as opposed to trees). In particular, the analysis shows how Belief\nPropagation breaks the symmetry between the $3!$ possible permutations of the\ncolor classes.\n",
        "submitter": "Elchanan Mossel",
        "authors": "Amin Coja-Oghlan and Elchanan Mossel and Dan Vilenchik",
        "comments": NaN,
        "journal-ref": "Combinatorics, Probability and Computing 18 (2009) 881 - 912",
        "doi": "10.1017/S096354830900981X",
        "report-no": NaN,
        "categories_x": "cs.CC cs.AI cs.DM",
        "license": NaN,
        "update_date": "2017-11-17",
        "authors_parsed": "Coja-Oghlan Amin; Mossel Elchanan; Vilenchik Dan",
        "categories_y": "cs.CC cs.AI cs.DM"
    },
    {
        "id": "803.4026",
        "title": "High-dimensional analysis of semidefinite relaxations for sparse\n  principal components",
        "abstract": "  Principal component analysis (PCA) is a classical method for dimensionality\nreduction based on extracting the dominant eigenvectors of the sample\ncovariance matrix. However, PCA is well known to behave poorly in the ``large\n$p$, small $n$'' setting, in which the problem dimension $p$ is comparable to\nor larger than the sample size $n$. This paper studies PCA in this\nhigh-dimensional regime, but under the additional assumption that the maximal\neigenvector is sparse, say, with at most $k$ nonzero components. We consider a\nspiked covariance model in which a base matrix is perturbed by adding a\n$k$-sparse maximal eigenvector, and we analyze two computationally tractable\nmethods for recovering the support set of this maximal eigenvector, as follows:\n(a) a simple diagonal thresholding method, which transitions from success to\nfailure as a function of the rescaled sample size\n$\\theta_{\\mathrm{dia}}(n,p,k)=n/[k^2\\log(p-k)]$; and (b) a more sophisticated\nsemidefinite programming (SDP) relaxation, which succeeds once the rescaled\nsample size $\\theta_{\\mathrm{sdp}}(n,p,k)=n/[k\\log(p-k)]$ is larger than a\ncritical threshold. In addition, we prove that no method, including the best\nmethod which has exponential-time complexity, can succeed in recovering the\nsupport if the order parameter $\\theta_{\\mathrm{sdp}}(n,p,k)$ is below a\nthreshold. Our results thus highlight an interesting trade-off between\ncomputational and statistical efficiency in high-dimensional inference.\n",
        "submitter": "Martin Wainwright",
        "authors": "Arash A. Amini, Martin J. Wainwright",
        "comments": "Published in at http://dx.doi.org/10.1214/08-AOS664 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)",
        "journal-ref": "Annals of Statistics 2009, Vol. 37, No. 5B, 2877-2921",
        "doi": "10.1214/08-AOS664",
        "report-no": "IMS-AOS-AOS664",
        "categories_x": "math.ST cs.IT math.IT stat.TH",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-08-26",
        "authors_parsed": "Amini Arash A.; Wainwright Martin J.",
        "categories_y": "math.ST cs.IT math.IT stat.TH"
    },
    {
        "id": "809.0448",
        "title": "The Stock Market as a Game: An Agent Based Approach to Trading in Stocks",
        "abstract": "  Just as war is sometimes fallaciously represented as a zero sum game -- when\nin fact war is a negative sum game - stock market trading, a positive sum game\nover time, is often erroneously represented as a zero sum game. This is called\nthe \"zero sum fallacy\" -- the erroneous belief that one trader in a stock\nmarket exchange can only improve their position provided some other trader's\nposition deteriorates. However, a positive sum game in absolute terms can be\nrecast as a zero sum game in relative terms. Similarly it appears that negative\nsum games in absolute terms have been recast as zero sum games in relative\nterms: otherwise, why would zero sum games be used to represent situations of\nwar? Such recasting may have heuristic or pedagogic interest but recasting must\nbe clearly explicited or risks generating confusion.\n  Keywords: Game theory, stock trading and agent based AI.\n",
        "submitter": "Eric Engle",
        "authors": "Eric Engle",
        "comments": "21 pages and accompanying program",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "q-fin.TR cs.AI cs.GT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2008-12-02",
        "authors_parsed": "Engle Eric",
        "categories_y": "q-fin.TR cs.AI cs.GT"
    },
    {
        "id": "812.0617",
        "title": "The Capacity Region of the Cognitive Z-interference Channel with One\n  Noiseless Component",
        "abstract": "  We study the discrete memoryless Z-interference channel (ZIC) where the\ntransmitter of the pair that suffers from interference is cognitive. We first\nprovide upper and lower bounds on the capacity of this channel. We then show\nthat, when the channel of the transmitter-receiver pair that does not face\ninterference is noiseless, the two bounds coincide and therefore yield the\ncapacity region. The obtained results imply that, unlike in the Gaussian\ncognitive ZIC, in the considered channel superposition encoding at the\nnon-cognitive transmitter as well as Gel'fand-Pinsker encoding at the cognitive\ntransmitter are needed in order to minimize the impact of interference. As a\nbyproduct of the obtained capacity region, we obtain the capacity result for a\ngeneralized Gel'fand-Pinsker problem.\n",
        "submitter": "Nan Liu",
        "authors": "Nan Liu, Ivana Maric, Andrea Goldsmith and Shlomo Shamai (Shitz)",
        "comments": "The conference version has been submitted to ISIT 2009",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.IT math.IT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2008-12-04",
        "authors_parsed": "Liu Nan Shitz; Maric Ivana Shitz; Goldsmith Andrea Shitz; Shamai Shlomo Shitz",
        "categories_y": "cs.IT math.IT"
    },
    {
        "id": "812.0904",
        "title": "An Approximation of the Outage Probability for Multi-hop AF Fixed Gain\n  Relay",
        "abstract": "  In this letter, we present a closed-form approximation of the outage\nprobability for the multi-hop amplify-and-forward (AF) relaying systems with\nfixed gain in Rayleigh fading channel. The approximation is derived from the\noutage event for each hop. The simulation results show the tightness of the\nproposed approximation in low and high signal-to-noise ratio (SNR) region.\n",
        "submitter": "Jun Kyoung Lee",
        "authors": "Jun Kyoung Lee, Janghoon Yang, Dong Ku Kim",
        "comments": "3 pages, 3 figures, Submitted to IEEE Communication Letters",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.PF",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2008-12-05",
        "authors_parsed": "Lee Jun Kyoung; Yang Janghoon; Kim Dong Ku",
        "categories_y": "cs.PF"
    },
    {
        "id": "907.0592",
        "title": "Credit Assignment in Adaptive Evolutionary Algorithms",
        "abstract": "  In this paper, a new method for assigning credit to search operators is\npresented. Starting with the principle of optimizing search bias, search\noperators are selected based on an ability to create solutions that are\nhistorically linked to future generations. Using a novel framework for defining\nperformance measurements, distributing credit for performance, and the\nstatistical interpretation of this credit, a new adaptive method is developed\nand shown to outperform a variety of adaptive and non-adaptive competitors.\n",
        "submitter": "James Whitacre",
        "authors": "James M. Whitacre, Tuan Q. Pham, Ruhul A. Sarker",
        "comments": NaN,
        "journal-ref": "Genetic And Evolutionary Computation Conference, 2006",
        "doi": "10.1145/1143997.1144206",
        "report-no": NaN,
        "categories_x": "cs.NE cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-07-06",
        "authors_parsed": "Whitacre James M.; Pham Tuan Q.; Sarker Ruhul A.",
        "categories_y": "cs.NE cs.AI"
    },
    {
        "id": "908.0122",
        "title": "Complete Security Framework for Wireless Sensor Networks",
        "abstract": "  Security concern for a Sensor Networks and level of security desired may\ndiffer according to application specific needs where the sensor networks are\ndeployed. Till now, most of the security solutions proposed for sensor networks\nare layer wise i.e a particular solution is applicable to single layer itself.\nSo, to integrate them all is a new research challenge. In this paper we took up\nthe challenge and have proposed an integrated comprehensive security framework\nthat will provide security services for all services of sensor network. We have\nadded one extra component i.e. Intelligent Security Agent (ISA) to assess level\nof security and cross layer interactions. This framework has many components\nlike Intrusion Detection System, Trust Framework, Key Management scheme and\nLink layer communication protocol. We have also tested it on three different\napplication scenarios in Castalia and Omnet++ simulator.\n",
        "submitter": "R Doomun",
        "authors": "Kalpana Sharma, M.K. Ghose, Kuldeep",
        "comments": "7 pages, International Journal of Computer Science and Information\n  Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423",
        "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3 No. 1, USA",
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-08-04",
        "authors_parsed": "Sharma Kalpana; Ghose M. K.; Kuldeep",
        "categories_y": "cs.CR"
    },
    {
        "id": "908.2042",
        "title": "Problems in application of LDPC codes to information reconciliation in\n  quantum key distribution protocols",
        "abstract": "  The information reconciliation in a quantum key distribution protocol can be\nstudied separately from other steps in the protocol. The problem of information\nreconciliation can be reduced to that of distributed source coding. Its\nsolution by LDPC codes is reviewed. We list some obstacles preventing the\nLDPC-based distributed source coding from becoming a more favorable alternative\nto the Cascade protocol for information reconciliation in quantum key\ndistribution protocols. This exposition does not require knowledge of the\nquantum theory.\n",
        "submitter": "Ryutaroh Matsumoto",
        "authors": "Ryutaroh Matsumoto",
        "comments": "10 pages, 1 figure. short survey article",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": "IT2009-41",
        "categories_x": "cs.IT cs.CR math.IT quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-09-13",
        "authors_parsed": "Matsumoto Ryutaroh",
        "categories_y": "cs.IT cs.CR math.IT quant-ph"
    },
    {
        "id": "909.4446",
        "title": "Elicitation strategies for fuzzy constraint problems with missing\n  preferences: algorithms and experimental studies",
        "abstract": "  Fuzzy constraints are a popular approach to handle preferences and\nover-constrained problems in scenarios where one needs to be cautious, such as\nin medical or space applications. We consider here fuzzy constraint problems\nwhere some of the preferences may be missing. This models, for example,\nsettings where agents are distributed and have privacy issues, or where there\nis an ongoing preference elicitation process. In this setting, we study how to\nfind a solution which is optimal irrespective of the missing preferences. In\nthe process of finding such a solution, we may elicit preferences from the user\nif necessary. However, our goal is to ask the user as little as possible. We\ndefine a combined solving and preference elicitation scheme with a large number\nof different instantiations, each corresponding to a concrete algorithm which\nwe compare experimentally. We compute both the number of elicited preferences\nand the \"user effort\", which may be larger, as it contains all the preference\nvalues the user has to compute to be able to respond to the elicitation\nrequests. While the number of elicited preferences is important when the\nconcern is to communicate as little information as possible, the user effort\nmeasures also the hidden work the user has to do to be able to communicate the\nelicited preferences. Our experimental results show that some of our algorithms\nare very good at finding a necessarily optimal solution while asking the user\nfor only a very small fraction of the missing preferences. The user effort is\nalso very small for the best algorithms. Finally, we test these algorithms on\nhard constraint problems with possibly missing constraints, where the aim is to\nfind feasible solutions irrespective of the missing constraints.\n",
        "submitter": "Toby Walsh",
        "authors": "Mirco Gelain, Maria Pini, Francesca Rossi, Brent Venable and Toby\n  Walsh",
        "comments": "Principles and Practice of Constraint Programming, 14th International\n  Conference, CP 2008, Sydney, Australia, September 14-18, 2008. Proceedings",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-09-25",
        "authors_parsed": "Gelain Mirco; Pini Maria; Rossi Francesca; Venable Brent; Walsh Toby",
        "categories_y": "cs.AI"
    },
    {
        "id": "910.0733",
        "title": "Co-Channel Interference Cancellation in OFDM Networks using Coordinated\n  Symbol Repetition and Soft Decision MLE CCI Canceler",
        "abstract": "  In this paper, a new scheme of downlink co-channel interference (CCI)\ncancellation in OFDM cellular networks is introduced for users at the\ncell-edge. Coordinated symbol transmission between base stations (BS) is\noperated where the same symbol is transmitted from different BS on different\nsub-carriers. At the mobile station (MS) receiver, we introduce a soft decision\nmaximum likelihood CCI canceler and a modified maximum ratio combining (M-MRC)\nto obtain an estimate of the transmitted symbols. Weights used in the combining\nmethod are derived from the channels coefficients between the cooperated BS and\nthe MS. Simulations show that the proposed scheme works well under\nfrequency-selective channels and frequency non-selective channels. A gain of 9\ndB and 6 dB in SIR is obtained under multipath fading and flat-fading channels,\nrespectively.\n",
        "submitter": "Manar Mohaisen",
        "authors": "Manar Mohaisen, KyungHi Chang",
        "comments": "4 pages, 8 figures, IEEE International Conference on Signal\n  Processing and Communications, 2007. ICSPC 2007",
        "journal-ref": NaN,
        "doi": "10.1109/ICSPC.2007.4728510",
        "report-no": NaN,
        "categories_x": "cs.OH",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2016-11-15",
        "authors_parsed": "Mohaisen Manar; Chang KyungHi",
        "categories_y": "cs.OH"
    },
    {
        "id": "1001.2813",
        "title": "A Monte Carlo Algorithm for Universally Optimal Bayesian Sequence\n  Prediction and Planning",
        "abstract": "  The aim of this work is to address the question of whether we can in\nprinciple design rational decision-making agents or artificial intelligences\nembedded in computable physics such that their decisions are optimal in\nreasonable mathematical senses. Recent developments in rare event probability\nestimation, recursive bayesian inference, neural networks, and probabilistic\nplanning are sufficient to explicitly approximate reinforcement learners of the\nAIXI style with non-trivial model classes (here, the class of resource-bounded\nTuring machines). Consideration of the effects of resource limitations in a\nconcrete implementation leads to insights about possible architectures for\nlearning systems using optimal decision makers as components.\n",
        "submitter": "Anthony Di Franco",
        "authors": "Anthony Di Franco",
        "comments": "Submitted to MDPI Algorithms Special Issue \"Algorithmic Complexity in\n  Physics & Embedded Artificial Intelligences\"",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "nlin.AO cond-mat.dis-nn cs.AI cs.LG stat.ML",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-01-19",
        "authors_parsed": "Di Franco Anthony",
        "categories_y": "nlin.AO cond-mat.dis-nn cs.AI cs.LG stat.ML"
    },
    {
        "id": "1006.2204",
        "title": "MDPs with Unawareness",
        "abstract": "  Markov decision processes (MDPs) are widely used for modeling decision-making\nproblems in robotics, automated control, and economics. Traditional MDPs assume\nthat the decision maker (DM) knows all states and actions. However, this may\nnot be true in many situations of interest. We define a new framework, MDPs\nwith unawareness (MDPUs) to deal with the possibilities that a DM may not be\naware of all possible actions. We provide a complete characterization of when a\nDM can learn to play near-optimally in an MDPU, and give an algorithm that\nlearns to play near-optimally when it is possible to do so, as efficiently as\npossible. In particular, we characterize when a near-optimal solution can be\nfound in polynomial time.\n",
        "submitter": "Nan Rong",
        "authors": "Joseph Y. Halpern, Nan Rong, Ashutosh Saxena",
        "comments": "11 pages",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-06-14",
        "authors_parsed": "Halpern Joseph Y.; Rong Nan; Saxena Ashutosh",
        "categories_y": "cs.AI"
    },
    {
        "id": "1010.4007",
        "title": "Colour Guided Colour Image Steganography",
        "abstract": "  Information security has become a cause of concern because of the electronic\neavesdropping. Capacity, robustness and invisibility are important parameters\nin information hiding and are quite difficult to achieve in a single algorithm.\nThis paper proposes a novel steganography technique for digital color image\nwhich achieves the purported targets. The professed methodology employs a\ncomplete random scheme for pixel selection and embedding of data. Of the three\ncolour channels (Red, Green, Blue) in a given colour image, the least two\nsignificant bits of any one of the channels of the color image is used to\nchannelize the embedding capacity of the remaining two channels. We have\ndevised three approaches to achieve various levels of our desired targets. In\nthe first approach, Red is the default guide but it results in localization of\nMSE in the remaining two channels, which makes it slightly vulnerable. In the\nsecond approach, user gets the liberty to select the guiding channel (Red,\nGreen or Blue) to guide the remaining two channels. It will increase the\nrobustness and imperceptibility of the embedded image however the MSE factor\nwill still remain as a drawback. The third approach improves the performance\nfactor as a cyclic methodology is employed and the guiding channel is selected\nin a cyclic fashion. This ensures the uniform distribution of MSE, which gives\nbetter robustness and imperceptibility along with enhanced embedding capacity.\nThe imperceptibility has been enhanced by suitably adapting optimal pixel\nadjustment process (OPAP) on the stego covers.\n",
        "submitter": "Gorge Sarah Prof.",
        "authors": "R.Amirtharajan, Sandeep Kumar Behera, Motamarri Abhilash Swarup,\n  Mohamed Ashfaaq K and John Bosco Balaguru Rayappan",
        "comments": "Universal Journal of Computer Science and Engineering Technology\n  (UniCSE)",
        "journal-ref": "1 (1), 16-23, Oct. 2010",
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.MM",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-10-20",
        "authors_parsed": "Amirtharajan R.; Behera Sandeep Kumar; Swarup Motamarri Abhilash; K Mohamed Ashfaaq; Rayappan John Bosco Balaguru",
        "categories_y": "cs.MM"
    },
    {
        "id": "1011.2644",
        "title": "Do AES encryptions act randomly?",
        "abstract": "  The Advanced Encryption Standard (AES) is widely recognized as the most\nimportant block cipher in common use nowadays. This high assurance in AES is\ngiven by its resistance to ten years of extensive cryptanalysis, that has shown\nno weakness, not even any deviation from the statistical behaviour expected\nfrom a random permutation. Only reduced versions of the ciphers have been\nbroken, but they are not usually implemented. In this paper we build a\ndistinguishing attack on the AES, exploiting the properties of a novel cipher\nembedding. With our attack we give some statistical evidence that the set of\nAES-$128$ encryptions acts on the message space in a way significantly\ndifferent than that of the set of random permutations acting on the same space.\nWhile we feel that more computational experiments by independent third parties\nare needed in order to validate our statistical results, we show that the\nnon-random behaviour is the same as we would predict using the property of our\nembedding. Indeed, the embedding lowers the nonlinearity of the AES rounds and\ntherefore the AES encryptions tend, on average, to keep low the rank of\nlow-rank matrices constructed in the large space. Our attack needs $2^{23}$\nplaintext-ciphertext pairs and costs the equivalent of $2^{48}$ encryptions.\n  We expect our attack to work also for AES-$192$ and AES-$256$, as confirmed\nby preliminary experiments.\n",
        "submitter": "Anna Rimoldi",
        "authors": "Anna Rimoldi and Massimiliano Sala and Enrico Bertolazzi",
        "comments": "15 pages",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.IT cs.CR math.IT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-11-12",
        "authors_parsed": "Rimoldi Anna; Sala Massimiliano; Bertolazzi Enrico",
        "categories_y": "cs.IT cs.CR math.IT"
    },
    {
        "id": "1102.5388",
        "title": "Energy Efficiency and Goodput Analysis in Two-Way Wireless Relay\n  Networks",
        "abstract": "  In this paper, we study two-way relay networks (TWRNs) in which two source\nnodes exchange their information via a relay node indirectly in Rayleigh fading\nchannels. Both Amplify-and-Forward (AF) and Decode-and-Forward (DF) techniques\nhave been analyzed in the TWRN employing a Markov chain model through which the\nnetwork operation is described and investigated in depth. Automatic\nRepeat-reQuest (ARQ) retransmission has been applied to guarantee the\nsuccessful packet delivery. The bit energy consumption and goodput expressions\nhave been derived as functions of transmission rate in a given AF or DF TWRN.\nNumerical results are used to identify the optimal transmission rates where the\nbit energy consumption is minimized or the goodput is maximized. The network\nperformances are compared in terms of energy and transmission efficiency in AF\nand DF modes.\n",
        "submitter": "Qing Chen",
        "authors": "Qing Chen, Mustafa Cenk Gursoy",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.IT math.IT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-03-01",
        "authors_parsed": "Chen Qing; Gursoy Mustafa Cenk",
        "categories_y": "cs.IT math.IT"
    },
    {
        "id": "1105.1117",
        "title": "Collective Animal Behavior from Bayesian Estimation and Probability\n  Matching",
        "abstract": "  Animals living in groups make movement decisions that depend, among other\nfactors, on social interactions with other group members. Our present\nunderstanding of social rules in animal collectives is mainly based on\nempirical fits to observations, with less emphasis in obtaining\nfirst-principles approaches that allow their derivation. Here we show that\npatterns of collective decisions can be derived from the basic ability of\nanimals to make probabilistic estimations in the presence of uncertainty. We\nbuild a decision-making model with two stages: Bayesian estimation and\nprobabilistic matching. In the first stage, each animal makes a Bayesian\nestimation of which behavior is best to perform taking into account personal\ninformation about the environment and social information collected by observing\nthe behaviors of other animals. In the probability matching stage, each animal\nchooses a behavior with a probability equal to the Bayesian-estimated\nprobability that this behavior is the most appropriate one. This model derives\nvery simple rules of interaction in animal collectives that depend only on two\ntypes of reliability parameters, one that each animal assigns to the other\nanimals and another given by the quality of the non-social information. We test\nour model by obtaining theoretically a rich set of observed collective patterns\nof decisions in three-spined sticklebacks, Gasterosteus aculeatus, a shoaling\nfish species. The quantitative link shown between probabilistic estimation and\ncollective rules of behavior allows a better contact with other fields such as\nforaging, mate selection, neurobiology and psychology, and gives predictions\nfor experiments directly testing the relationship between estimation and\ncollective behavior.\n",
        "submitter": "Alfonso P\\'erez-Escudero",
        "authors": "Alfonso P\\'erez-Escudero, Gonzalo G. de Polavieja",
        "comments": "19 pages, including Supplemental Figures and Supplemental Text. In\n  press in PLoS Computational Biology",
        "journal-ref": "PLoS Comput Biol 7(11): e1002282 (2011)",
        "doi": "10.1371/journal.pcbi.1002282",
        "report-no": NaN,
        "categories_x": "q-bio.QM cs.SI nlin.AO physics.data-an physics.soc-ph q-bio.NC",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-11-22",
        "authors_parsed": "Pérez-Escudero Alfonso; de Polavieja Gonzalo G.",
        "categories_y": "q-bio.QM cs.SI nlin.AO physics.data-an physics.soc-ph q-bio.NC"
    },
    {
        "id": "1106.3703",
        "title": "Prediction and Modularity in Dynamical Systems",
        "abstract": "  Identifying and understanding modular organizations is centrally important in\nthe study of complex systems. Several approaches to this problem have been\nadvanced, many framed in information-theoretic terms. Our treatment starts from\nthe complementary point of view of statistical modeling and prediction of\ndynamical systems. It is known that for finite amounts of training data,\nsimpler models can have greater predictive power than more complex ones. We use\nthe trade-off between model simplicity and predictive accuracy to generate\noptimal multiscale decompositions of dynamical networks into weakly-coupled,\nsimple modules. State-dependent and causal versions of our method are also\nproposed.\n",
        "submitter": "Artemy Kolchinsky",
        "authors": "Artemy Kolchinsky, Luis M. Rocha",
        "comments": "v1 published in ECAL 2011 (European Conference on Artificial Life).\n  v2 fixes error in causal risk (number of parameters should be based on\n  training distribution)",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "nlin.AO cs.AI cs.IT cs.LG cs.SY math.IT q-bio.QM stat.ME",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-01-19",
        "authors_parsed": "Kolchinsky Artemy; Rocha Luis M.",
        "categories_y": "nlin.AO cs.AI cs.IT cs.LG cs.SY math.IT q-bio.QM stat.ME"
    },
    {
        "id": "1107.4035",
        "title": "Towards Completely Lifted Search-based Probabilistic Inference",
        "abstract": "  The promise of lifted probabilistic inference is to carry out probabilistic\ninference in a relational probabilistic model without needing to reason about\neach individual separately (grounding out the representation) by treating the\nundistinguished individuals as a block. Current exact methods still need to\nground out in some cases, typically because the representation of the\nintermediate results is not closed under the lifted operations. We set out to\nanswer the question as to whether there is some fundamental reason why lifted\nalgorithms would need to ground out undifferentiated individuals. We have two\nmain results: (1) We completely characterize the cases where grounding is\npolynomial in a population size, and show how we can do lifted inference in\ntime polynomial in the logarithm of the population size for these cases. (2)\nFor the case of no-argument and single-argument parametrized random variables\nwhere the grounding is not polynomial in a population size, we present lifted\ninference which is polynomial in the population size whereas grounding is\nexponential. Neither of these cases requires reasoning separately about the\nindividuals that are not explicitly mentioned.\n",
        "submitter": "David Poole",
        "authors": "David Poole, Fahiem Bacchus, Jacek Kisynski",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-07-22",
        "authors_parsed": "Poole David; Bacchus Fahiem; Kisynski Jacek",
        "categories_y": "cs.AI"
    },
    {
        "id": "1109.2271",
        "title": "Feature-Based Matrix Factorization",
        "abstract": "  Recommender system has been more and more popular and widely used in many\napplications recently. The increasing information available, not only in\nquantities but also in types, leads to a big challenge for recommender system\nthat how to leverage these rich information to get a better performance. Most\ntraditional approaches try to design a specific model for each scenario, which\ndemands great efforts in developing and modifying models. In this technical\nreport, we describe our implementation of feature-based matrix factorization.\nThis model is an abstract of many variants of matrix factorization models, and\nnew types of information can be utilized by simply defining new features,\nwithout modifying any lines of code. Using the toolkit, we built the best\nsingle model reported on track 1 of KDDCup'11.\n",
        "submitter": "Tianqi Chen",
        "authors": "Tianqi Chen, Zhao Zheng, Qiuxia Lu, Weinan Zhang, Yong Yu",
        "comments": "Minor update, add some related works",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI cs.IR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-12-30",
        "authors_parsed": "Chen Tianqi; Zheng Zhao; Lu Qiuxia; Zhang Weinan; Yu Yong",
        "categories_y": "cs.AI cs.IR"
    },
    {
        "id": "1110.156",
        "title": "On the Coloring of Grid Wireless Sensor Networks: the Vector-Based\n  Coloring Method",
        "abstract": "  Graph coloring is used in wireless networks to optimize network resources:\nbandwidth and energy. Nodes access the medium according to their color. It is\nthe responsibility of the coloring algorithm to ensure that interfering nodes\ndo not have the same color. In this research report, we focus on wireless\nsensor networks with grid topologies. How does a coloring algorithm take\nadvantage of the regularity of grid topology to provide an optimal periodic\ncoloring, that is a coloring with the minimum number of colors? We propose the\nVector-Based Coloring Method, denoted VCM, a new method that is able to provide\nan optimal periodic coloring for any radio transmission range and for any h-hop\ncoloring, h>=1. This method consists in determining at which grid nodes a color\ncan be reproduced without creating interferences between these nodes while\nminimizing the number of colors used. We compare the number of colors provided\nby VCM with the number of colors obtained by a distributed coloring algorithm\nwith line and column priority assignments. We also provide bounds on the number\nof colors of optimal general colorings of the infinite grid, and show that\nperiodic colorings (and thus VCM) are asymptotically optimal. Finally, we\ndiscuss the applicability of this method to a real wireless network.\n",
        "submitter": "Cedric Adjih",
        "authors": "Ichrak Amdouni (INRIA Rocquencourt), C\\'edric Adjih (INRIA\n  Rocquencourt), Pascale Minet (INRIA Rocquencourt)",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.NI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-10-10",
        "authors_parsed": "Amdouni Ichrak INRIA Rocquencourt; Adjih Cédric INRIA\n  Rocquencourt; Minet Pascale INRIA Rocquencourt",
        "categories_y": "cs.NI"
    },
    {
        "id": "1110.6573",
        "title": "Reversed Space Attacks",
        "abstract": "  Many quantum key distribution (QKD) schemes are based on sending and\nmeasuring qubits -- two-dimensional quantum systems. Yet, in practical\nrealizations and experiments, the measuring devices at the receiver's (Bob)\nsite commonly do not measure a two-dimensional system but rather a quantum\nspace of a larger dimension. Such an enlargement sometimes results from\nimperfect devices. However, in various QKD protocols such enlargement exists\neven in the ideal scenario when all devices are assumed to be perfect. This\nissue is common, for instance, in QKD schemes implemented via photons, where\nthe parties' devices are based on Mach-Zehnder interferometers, as these\ninherently enlarge the quantum space in use.\n  We show how space enlargement at Bob's site exposes the implemented protocol\nto new kinds of attacks, attacks that have not yet been explicitly pinpointed\nnor rigorously analyzed. We name these the \"reversed space attacks\". A key\ninsight in formalizing our attacks, is the idea of taking all states defining\nBob's (large) measured space and reversing them in time in order to identify\nprecisely the space that an eavesdropper may attack. We employ such attacks on\ntwo variants of intereferometric-based QKD recently experimented by several\ngroups, and show how to get full information on the qubit sent by Alice, while\ninducing no errors at all. The technique we develop here has subsequently been\nused in a closely related work (Boyer, Gelles, and Mor, Physical Review A,\n2014) to demonstrate a (weaker variant of) reversed-space attack on both\ninterferometric-based and polarization-based QKD.\n",
        "submitter": "Ran Gelles",
        "authors": "Ran Gelles and Tal Mor",
        "comments": "20 pages, 4 figures; A preliminary version of this work appeared in\n  TPNC 2012: Proceedings of the 1st International Conference on Theory and\n  Practice of Natural Computing, LNCS 7505, pages 133-146, October 2012",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "quant-ph cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2016-05-23",
        "authors_parsed": "Gelles Ran; Mor Tal",
        "categories_y": "quant-ph cs.CR"
    },
    {
        "id": "1111.0712",
        "title": "Online Learning with Preference Feedback",
        "abstract": "  We propose a new online learning model for learning with preference feedback.\nThe model is especially suited for applications like web search and recommender\nsystems, where preference data is readily available from implicit user feedback\n(e.g. clicks). In particular, at each time step a potentially structured object\n(e.g. a ranking) is presented to the user in response to a context (e.g.\nquery), providing him or her with some unobserved amount of utility. As\nfeedback the algorithm receives an improved object that would have provided\nhigher utility. We propose a learning algorithm with provable regret bounds for\nthis online learning setting and demonstrate its effectiveness on a web-search\napplication. The new learning model also applies to many other interactive\nlearning problems and admits several interesting extensions.\n",
        "submitter": "Pannagadatta Shivaswamy",
        "authors": "Pannagadatta K. Shivaswamy and Thorsten Joachims",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.LG cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-11-04",
        "authors_parsed": "Shivaswamy Pannagadatta K.; Joachims Thorsten",
        "categories_y": "cs.LG cs.AI"
    },
    {
        "id": "1112.3115",
        "title": "The Diversity Paradox: How Nature Resolves an Evolutionary Dilemma",
        "abstract": "  Adaptation to changing environments is a hallmark of biological systems.\nDiversity in traits is necessary for adaptation and can influence the survival\nof a population faced with novelty. In habitats that remain stable over many\ngenerations, stabilizing selection reduces trait differences within\npopulations, thereby appearing to remove the diversity needed for heritable\nadaptive responses in new environments. Paradoxically, field studies have\ndocumented numerous populations under long periods of stabilizing selection and\nevolutionary stasis that have rapidly evolved under changed environmental\nconditions. In this article, we review how cryptic genetic variation (CGV)\nresolves this diversity paradox by allowing populations in a stable environment\nto gradually accumulate hidden genetic diversity that is revealed as trait\ndifferences when environments change. Instead of being in conflict,\nenvironmental stasis supports CGV accumulation and thus appears to facilitate\nrapid adaptation in new environments as suggested by recent CGV studies.\nSimilarly, degeneracy has been found to support both genetic and non-genetic\nadaptation at many levels of biological organization. Degenerate, as opposed to\ndiverse or redundant, ensembles appear functionally redundant in certain\nenvironmental contexts but functionally diverse in others. CGV and degeneracy\nparadigms for adaptation are integrated in this review, revealing a common set\nof principles that support adaptation at multiple levels of biological\norganization. Though a discussion of simulation studies, molecular-based\nexperimental systems, principles from population genetics, and field\nexperiments, we demonstrate that CGV and degeneracy reflect complementary\ntop-down and bottom-up, respectively, conceptualizations of the same basic\nphenomenon and arguably capture a universal feature of biological adaptive\nprocesses.\n",
        "submitter": "James Whitacre",
        "authors": "James M. Whitacre and Sergei P. Atamas",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "nlin.AO cs.AI q-bio.PE",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-12-15",
        "authors_parsed": "Whitacre James M.; Atamas Sergei P.",
        "categories_y": "nlin.AO cs.AI q-bio.PE"
    },
    {
        "id": "1203.0697",
        "title": "Learning High-Dimensional Mixtures of Graphical Models",
        "abstract": "  We consider unsupervised estimation of mixtures of discrete graphical models,\nwhere the class variable corresponding to the mixture components is hidden and\neach mixture component over the observed variables can have a potentially\ndifferent Markov graph structure and parameters. We propose a novel approach\nfor estimating the mixture components, and our output is a tree-mixture model\nwhich serves as a good approximation to the underlying graphical model mixture.\nOur method is efficient when the union graph, which is the union of the Markov\ngraphs of the mixture components, has sparse vertex separators between any pair\nof observed variables. This includes tree mixtures and mixtures of bounded\ndegree graphs. For such models, we prove that our method correctly recovers the\nunion graph structure and the tree structures corresponding to\nmaximum-likelihood tree approximations of the mixture components. The sample\nand computational complexities of our method scale as $\\poly(p, r)$, for an\n$r$-component mixture of $p$-variate graphical models. We further extend our\nresults to the case when the union graph has sparse local separators between\nany pair of observed variables, such as mixtures of locally tree-like graphs,\nand the mixture components are in the regime of correlation decay.\n",
        "submitter": "Animashree Anandkumar",
        "authors": "A. Anandkumar, D. Hsu, F. Huang and S. M. Kakade",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "stat.ML cs.AI cs.LG",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-07-03",
        "authors_parsed": "Anandkumar A.; Hsu D.; Huang F.; Kakade S. M.",
        "categories_y": "stat.ML cs.AI cs.LG"
    },
    {
        "id": "1204.1995",
        "title": "Attribute Exploration of Gene Regulatory Processes",
        "abstract": "  This thesis aims at the logical analysis of discrete processes, in particular\nof such generated by gene regulatory networks. States, transitions and\noperators from temporal logics are expressed in the language of Formal Concept\nAnalysis. By the attribute exploration algorithm, an expert or a computer\nprogram is enabled to validate a minimal and complete set of implications, e.g.\nby comparison of predictions derived from literature with observed data. Here,\nthese rules represent temporal dependencies within gene regulatory networks\nincluding coexpression of genes, reachability of states, invariants or possible\ncausal relationships. This new approach is embedded into the theory of\nuniversal coalgebras, particularly automata, Kripke structures and Labelled\nTransition Systems. A comparison with the temporal expressivity of Description\nLogics is made. The main theoretical results concern the integration of\nbackground knowledge into the successive exploration of the defined data\nstructures (formal contexts). Applying the method a Boolean network from\nliterature modelling sporulation of Bacillus subtilis is examined. Finally, we\ndeveloped an asynchronous Boolean network for extracellular matrix formation\nand destruction in the context of rheumatoid arthritis.\n",
        "submitter": "Johannes Wollbold",
        "authors": "Johannes Wollbold",
        "comments": "111 pages, 9 figures, file size 2.1 MB, PhD thesis University of\n  Jena, Germany, Faculty of Mathematics and Computer Science, 2011. Online\n  available at http://www.db-thueringen.de/servlets/DocumentServlet?id=19601",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "q-bio.MN cs.CE cs.LO math.LO",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "update_date": "2012-04-11",
        "authors_parsed": "Wollbold Johannes",
        "categories_y": "q-bio.MN cs.CE cs.LO math.LO"
    },
    {
        "id": "1204.2727",
        "title": "The Cost of Perfection for Matchings in Graphs",
        "abstract": "  Perfect matchings and maximum weight matchings are two fundamental\ncombinatorial structures. We consider the ratio between the maximum weight of a\nperfect matching and the maximum weight of a general matching. Motivated by the\ncomputer graphics application in triangle meshes, where we seek to convert a\ntriangulation into a quadrangulation by merging pairs of adjacent triangles, we\nfocus mainly on bridgeless cubic graphs. First, we characterize graphs that\nattain the extreme ratios. Second, we present a lower bound for all bridgeless\ncubic graphs. Third, we present upper bounds for subclasses of bridgeless cubic\ngraphs, most of which are shown to be tight. Additionally, we present tight\nbounds for the class of regular bipartite graphs.\n",
        "submitter": "Guilherme D. da Fonseca",
        "authors": "Emilio Vital Brazil, Guilherme D. da Fonseca, Celina de Figueiredo and\n  Diana Sasaki",
        "comments": NaN,
        "journal-ref": "Discrete Applied Mathematics, 210:112-122, 2016",
        "doi": "10.1016/j.dam.2014.12.006",
        "report-no": NaN,
        "categories_x": "cs.DM",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2018-11-08",
        "authors_parsed": "Brazil Emilio Vital; da Fonseca Guilherme D.; de Figueiredo Celina; Sasaki Diana",
        "categories_y": "cs.DM"
    },
    {
        "id": "1205.245",
        "title": "MIMO Relaying Broadcast Channels with Linear Precoding and Quantized\n  Channel State Information Feedback",
        "abstract": "  Multi-antenna relaying has emerged as a promising technology to enhance the\nsystem performance in cellular networks. However, when precoding techniques are\nutilized to obtain multi-antenna gains, the system generally requires channel\nstate information (CSI) at the transmitters. We consider a linear precoding\nscheme in a MIMO relaying broadcast channel with quantized CSI feedback from\nboth two-hop links. With this scheme, each remote user feeds back its quantized\nCSI to the relay, and the relay sends back the quantized precoding information\nto the base station (BS). An upper bound on the rate loss due to quantized\nchannel knowledge is first characterized. Then, in order to maintain the rate\nloss within a predetermined gap for growing SNRs, a strategy of scaling\nquantization quality of both two-hop links is proposed. It is revealed that the\nnumbers of feedback bits of both links should scale linearly with the transmit\npower at the relay, while only the bit number of feedback from the relay to the\nBS needs to grow with the increasing transmit power at the BS. Numerical\nresults are provided to verify the proposed strategy for feedback quality\ncontrol.\n",
        "submitter": "Wei  Xu",
        "authors": "Wei Xu, Xiaodai Dong, and Wu-Sheng Lu",
        "comments": "13pages appeared in IEEE Transactions on Signal Processing",
        "journal-ref": "W. Xu, X. Dong, and W.-S. Lu \"MIMO relaying broadcast channels\n  with linear precoding and quantized channel state information feedback,\" IEEE\n  Trans. Sig. Proc., vol. 58, no. 10, pp. 5233-5245, Oct. 2010",
        "doi": "10.1109/TSP.2010.2056687",
        "report-no": NaN,
        "categories_x": "cs.IT math.IT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-05-14",
        "authors_parsed": "Xu Wei; Dong Xiaodai; Lu Wu-Sheng",
        "categories_y": "cs.IT math.IT"
    },
    {
        "id": "1206.3658",
        "title": "Alan Turing and the \"Hard\" and \"Easy\" Problem of Cognition: Doing and\n  Feeling",
        "abstract": "  The \"easy\" problem of cognitive science is explaining how and why we can do\nwhat we can do. The \"hard\" problem is explaining how and why we feel. Turing's\nmethodology for cognitive science (the Turing Test) is based on doing: Design a\nmodel that can do anything a human can do, indistinguishably from a human, to a\nhuman, and you have explained cognition. Searle has shown that the successful\nmodel cannot be solely computational. Sensory-motor robotic capacities are\nnecessary to ground some, at least, of the model's words, in what the robot can\ndo with the things in the world that the words are about. But even grounding is\nnot enough to guarantee that -- nor to explain how and why -- the model feels\n(if it does). That problem is much harder to solve (and perhaps insoluble).\n",
        "submitter": "Stevan Harnad",
        "authors": "Stevan Harnad",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI cs.RO",
        "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/",
        "update_date": "2012-06-19",
        "authors_parsed": "Harnad Stevan",
        "categories_y": "cs.AI cs.RO"
    },
    {
        "id": "1206.5279",
        "title": "Making life better one large system at a time: Challenges for UAI\n  research",
        "abstract": "  The rapid growth and diversity in service offerings and the ensuing\ncomplexity of information technology ecosystems present numerous management\nchallenges (both operational and strategic). Instrumentation and measurement\ntechnology is, by and large, keeping pace with this development and growth.\nHowever, the algorithms, tools, and technology required to transform the data\ninto relevant information for decision making are not. The claim in this paper\n(and the invited talk) is that the line of research conducted in Uncertainty in\nArtificial Intelligence is very well suited to address the challenges and close\nthis gap. I will support this claim and discuss open problems using recent\nexamples in diagnosis, model discovery, and policy optimization on three real\nlife distributed systems.\n",
        "submitter": "Moises Goldszmidt",
        "authors": "Moises Goldszmidt",
        "comments": "Appears in Proceedings of the Twenty-Third Conference on Uncertainty\n  in Artificial Intelligence (UAI2007)",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": "UAI-P-2007-PG-475-481",
        "categories_x": "cs.SE cs.AI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-06-26",
        "authors_parsed": "Goldszmidt Moises",
        "categories_y": "cs.SE cs.AI"
    },
    {
        "id": "1206.5754",
        "title": "Bayesian Modeling with Gaussian Processes using the GPstuff Toolbox",
        "abstract": "  Gaussian processes (GP) are powerful tools for probabilistic modeling\npurposes. They can be used to define prior distributions over latent functions\nin hierarchical Bayesian models. The prior over functions is defined implicitly\nby the mean and covariance function, which determine the smoothness and\nvariability of the function. The inference can then be conducted directly in\nthe function space by evaluating or approximating the posterior process.\nDespite their attractive theoretical properties GPs provide practical\nchallenges in their implementation. GPstuff is a versatile collection of\ncomputational tools for GP models compatible with Linux and Windows MATLAB and\nOctave. It includes, among others, various inference methods, sparse\napproximations and tools for model assessment. In this work, we review these\ntools and demonstrate the use of GPstuff in several models.\n",
        "submitter": "Aki Vehtari",
        "authors": "Jarno Vanhatalo, Jaakko Riihim\\\"aki, Jouni Hartikainen, Pasi\n  Jyl\\\"anki, Ville Tolvanen and Aki Vehtari",
        "comments": "- Updated according to GPstuff 4.6. Added, e.g., Pareto smoothed\n  importance sampling",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "stat.ML cs.AI cs.MS",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-07-16",
        "authors_parsed": "Vanhatalo Jarno; Riihimäki Jaakko; Hartikainen Jouni; Jylänki Pasi; Tolvanen Ville; Vehtari Aki",
        "categories_y": "stat.ML cs.AI cs.MS"
    },
    {
        "id": "1208.2783",
        "title": "Topology Inspired Problems for Cellular Automata, and a Counterexample\n  in Topology",
        "abstract": "  We consider two relatively natural topologizations of the set of all cellular\nautomata on a fixed alphabet. The first turns out to be rather pathological, in\nthat the countable space becomes neither first-countable nor sequential. Also,\nreversible automata form a closed set, while surjective ones are dense. The\nsecond topology, which is induced by a metric, is studied in more detail.\nContinuity of composition (under certain restrictions) and inversion, as well\nas closedness of the set of surjective automata, are proved, and some\ncounterexamples are given. We then generalize this space, in the sense that\nevery shift-invariant measure on the configuration space induces a pseudometric\non cellular automata, and study the properties of these spaces. We also\ncharacterize the pseudometric spaces using the Besicovitch distance, and show a\nconnection to the first (pathological) space.\n",
        "submitter": "EPTCS",
        "authors": "Ville Salo (University of Turku, Finland), Ilkka T\\\"orm\\\"a (University\n  of Turku, Finland)",
        "comments": "In Proceedings AUTOMATA&JAC 2012, arXiv:1208.2498",
        "journal-ref": "EPTCS 90, 2012, pp. 53-68",
        "doi": "10.4204/EPTCS.90.5",
        "report-no": NaN,
        "categories_x": "nlin.CG cs.FL math.GN",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-08-15",
        "authors_parsed": "Salo Ville University of Turku, Finland; Törmä Ilkka University\n  of Turku, Finland",
        "categories_y": "nlin.CG cs.FL math.GN"
    },
    {
        "id": "1208.537",
        "title": "Isogeny volcanoes",
        "abstract": "  The remarkable structure and computationally explicit form of isogeny graphs\nof elliptic curves over a finite field has made them an important tool for\ncomputational number theorists and practitioners of elliptic curve\ncryptography. This expository paper recounts the theory behind these graphs and\nexamines several recently developed algorithms that realize substantial (often\ndramatic) performance gains by exploiting this theory.\n",
        "submitter": "Andrew Sutherland",
        "authors": "Andrew V. Sutherland",
        "comments": "Invited ANTS X paper, minor edits, 18 pages",
        "journal-ref": "ANTS X: Proceedings of the Tenth Algorithmic Number Theory\n  Symposium, 2012, 507-530",
        "doi": "10.2140/obs.2013.1.507",
        "report-no": NaN,
        "categories_x": "math.NT cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2014-06-20",
        "authors_parsed": "Sutherland Andrew V.",
        "categories_y": "math.NT cs.CR"
    },
    {
        "id": "1209.1198",
        "title": "Multivariate Interpolation Formula over Finite Fields and Its\n  Applications in Coding Theory",
        "abstract": "  A multivariate interpolation formula (MVIF) over finite fields is presented\nby using the proposed Kronecker delta function. The MVIF can be applied to\nyield polynomial relations over the base field among homogeneous symmetric\nrational functions. Besides the property that all the coefficients are coming\nfrom the base field, there is also a significant one on the degrees of the\nobtained polynomial; namely, the degree of each term satisfies certain\ncondition. Next, for any cyclic codes the unknown syndrome representation can\nalso be provided by the proposed MVIF and also has the same properties. By\napplying the unknown syndrome representation and the Berlekamp-Massey\nalgorithm, one-step decoding algorithms can be developed to determine the error\nlocator polynomials for arbitrary cyclic codes.\n",
        "submitter": "Chong-Dao Lee",
        "authors": "Yaotsu Chang, Chong-Dao Lee, Keqin Feng",
        "comments": "11 pages. This work is supported by the grant of the NSFC no.10990011\n  and the Tsinghua National Lab. of Information Science and Technology",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.IT math.IT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-12-21",
        "authors_parsed": "Chang Yaotsu; Lee Chong-Dao; Feng Keqin",
        "categories_y": "cs.IT math.IT"
    },
    {
        "id": "1209.2204",
        "title": "How is non-knowledge represented in economic theory?",
        "abstract": "  In this article, we address the question of how non-knowledge about future\nevents that influence economic agents' decisions in choice settings has been\nformally represented in economic theory up to date. To position our discussion\nwithin the ongoing debate on uncertainty, we provide a brief review of\nhistorical developments in economic theory and decision theory on the\ndescription of economic agents' choice behaviour under conditions of\nuncertainty, understood as either (i) ambiguity, or (ii) unawareness.\nAccordingly, we identify and discuss two approaches to the formalisation of\nnon-knowledge: one based on decision-making in the context of a state space\nrepresenting the exogenous world, as in Savage's axiomatisation and some\nsuccessor concepts (ambiguity as situations with unknown probabilities), and\none based on decision-making over a set of menus of potential future\nopportunities, providing the possibility of derivation of agents' subjective\nstate spaces (unawareness as situation with imperfect subjective knowledge of\nall future events possible). We also discuss impeding challenges of the\nformalisation of non-knowledge.\n",
        "submitter": "Henk van Elst",
        "authors": "Ekaterina Svetlova and Henk van Elst (Karlshochschule International\n  University)",
        "comments": "18 pages, LaTeX2e, hyperlinked references",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "q-fin.GN cs.AI stat.AP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-09-12",
        "authors_parsed": "Svetlova Ekaterina Karlshochschule International\n  University; van Elst Henk Karlshochschule International\n  University",
        "categories_y": "q-fin.GN cs.AI stat.AP"
    },
    {
        "id": "1210.4901",
        "title": "An Approximate Solution Method for Large Risk-Averse Markov Decision\n  Processes",
        "abstract": "  Stochastic domains often involve risk-averse decision makers. While recent\nwork has focused on how to model risk in Markov decision processes using risk\nmeasures, it has not addressed the problem of solving large risk-averse\nformulations. In this paper, we propose and analyze a new method for solving\nlarge risk-averse MDPs with hybrid continuous-discrete state spaces and\ncontinuous action spaces. The proposed method iteratively improves a bound on\nthe value function using a linearity structure of the MDP. We demonstrate the\nutility and properties of the method on a portfolio optimization problem.\n",
        "submitter": "Marek Petrik",
        "authors": "Marek Petrik, Dharmashankar Subramanian",
        "comments": "Appears in Proceedings of the Twenty-Eighth Conference on Uncertainty\n  in Artificial Intelligence (UAI2012)",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": "UAI-P-2012-PG-805-814",
        "categories_x": "q-fin.PM cs.AI cs.GT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-10-19",
        "authors_parsed": "Petrik Marek; Subramanian Dharmashankar",
        "categories_y": "q-fin.PM cs.AI cs.GT"
    },
    {
        "id": "1210.5224",
        "title": "Use of Repositories and its Significance for Engineering Education / El\n  Uso de Repositorios y su Importancia para la Educaci\\'on en Ingenier\\'ia",
        "abstract": "  Institutional repositories are deposits of different types of digital files\nfor access, disseminate and preserve them. This paper aims to explain the\nimportance of repositories in the academic field of engineering as a way to\ndemocratize knowledge by teachers, researchers and students to contribute to\nsocial and human development. These repositories, usually framed in the Open\nAccess Initiative, allow to ensure access free and open (unrestricted legal and\neconomic) to different sectors of society and, thus, can make use of the\nservices they offer. Finally, that repositories are evolving in the academic\nand scientific, and different disciplines of engineering should be prepared to\nprovide a range of services through these systems to society of today and\ntomorrow.\n",
        "submitter": "Jose Texier",
        "authors": "Jose Texier, Marisa De Giusti, Nestor Oviedo, Gonzalo Villarreal,\n  Ariel Lira",
        "comments": "This paper is a preprint in WEEF (World Engineering Education Forum)\n  2012. http://www.weef2012.edu.ar/home1.php. ISBN: 978-987-1896-03-5",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.DL",
        "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/",
        "update_date": "2012-11-01",
        "authors_parsed": "Texier Jose; De Giusti Marisa; Oviedo Nestor; Villarreal Gonzalo; Lira Ariel",
        "categories_y": "cs.DL"
    },
    {
        "id": "1302.631",
        "title": "Estimating Sectoral Pollution Load in Lagos, Nigeria Using Data Mining\n  Techniques",
        "abstract": "  Industrial pollution is often considered to be one of the prime factors\ncontributing to air, water and soil pollution. Sectoral pollution loads\n(ton/yr) into different media (i.e. air, water and land) in Lagos were\nestimated using Industrial Pollution Projected System (IPPS). These were\nfurther studied using Artificial neural Networks (ANNs), a data mining\ntechnique that has the ability of detecting and describing patterns in large\ndata sets with variables that are non- linearly related. Time Lagged Recurrent\nNetwork (TLRN) appeared as the best Neural Network model among all the neural\nnetworks considered which includes Multilayer Perceptron (MLP) Network,\nGeneralized Feed Forward Neural Network (GFNN), Radial Basis Function (RBF)\nNetwork and Recurrent Network (RN). TLRN modelled the data-sets better than the\nothers in terms of the mean average error (MAE) (0.14), time (39 s) and linear\ncorrelation coefficient (0.84). The results showed that Artificial Neural\nNetworks (ANNs) technique (i.e., Time Lagged Recurrent Network) is also\napplicable and effective in environmental assessment study. Keywords:\nArtificial Neural Networks (ANNs), Data Mining Techniques, Industrial Pollution\nProjection System (IPPS), Pollution load, Pollution Intensity.\n",
        "submitter": "Emmanuel Olumuyiwa Adetula",
        "authors": "Adesesan .B Adeyemo, Adebola A. Oketola, Emmanuel O. Adetula, O.\n  Osibanjo",
        "comments": "11 pages, 11 figures",
        "journal-ref": "A.B ADEYEMO, A.A OKETOLA, E.O ADETULA, O.OSIBANJO (2012):\n  Estimating Sectoral Pollution Load in Lagos, Nigeria Using Data Mining\n  Techniques,International-Journal-of-Computer-Science-Issues, Volume 9, Issue\n  6, November 2012 pages 465-475",
        "doi": NaN,
        "report-no": "11 pages",
        "categories_x": "cs.NE",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-02-27",
        "authors_parsed": "Adeyemo Adesesan . B; Oketola Adebola A.; Adetula Emmanuel O.; Osibanjo O.",
        "categories_y": "cs.NE"
    },
    {
        "id": "1302.7056",
        "title": "KSU KDD: Word Sense Induction by Clustering in Topic Space",
        "abstract": "  We describe our language-independent unsupervised word sense induction\nsystem. This system only uses topic features to cluster different word senses\nin their global context topic space. Using unlabeled data, this system trains a\nlatent Dirichlet allocation (LDA) topic model then uses it to infer the topics\ndistribution of the test instances. By clustering these topics distributions in\ntheir topic space we cluster them into different senses. Our hypothesis is that\ncloseness in topic space reflects similarity between different word senses.\nThis system participated in SemEval-2 word sense induction and disambiguation\ntask and achieved the second highest V-measure score among all other systems.\n",
        "submitter": "Wesam Elshamy",
        "authors": "Wesam Elshamy, Doina Caragea, William Hsu",
        "comments": NaN,
        "journal-ref": "Proceedings of the 5th International Workshop on Semantic\n  Evaluation, pages 367-370, Uppsala, Sweden, July 2010. Association for\n  Computational Linguistics",
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.CL cs.AI stat.AP stat.ML",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-03-06",
        "authors_parsed": "Elshamy Wesam; Caragea Doina; Hsu William",
        "categories_y": "cs.CL cs.AI stat.AP stat.ML"
    },
    {
        "id": "1303.0875",
        "title": "LT^2C^2: A language of thought with Turing-computable Kolmogorov\n  complexity",
        "abstract": "  In this paper, we present a theoretical effort to connect the theory of\nprogram size to psychology by implementing a concrete language of thought with\nTuring-computable Kolmogorov complexity (LT^2C^2) satisfying the following\nrequirements: 1) to be simple enough so that the complexity of any given finite\nbinary sequence can be computed, 2) to be based on tangible operations of human\nreasoning (printing, repeating,...), 3) to be sufficiently powerful to generate\nall possible sequences but not too powerful as to identify regularities which\nwould be invisible to humans. We first formalize LT^2C^2, giving its syntax and\nsemantics and defining an adequate notion of program size. Our setting leads to\na Kolmogorov complexity function relative to LT^2C^2 which is computable in\npolynomial time, and it also induces a prediction algorithm in the spirit of\nSolomonoff's inductive inference theory. We then prove the efficacy of this\nlanguage by investigating regularities in strings produced by participants\nattempting to generate random strings. Participants had a profound\nunderstanding of randomness and hence avoided typical misconceptions such as\nexaggerating the number of alternations. We reasoned that remaining\nregularities would express the algorithmic nature of human thoughts, revealed\nin the form of specific patterns. Kolmogorov complexity relative to LT^2C^2\npassed three expected tests examined here: 1) human sequences were less complex\nthan control PRNG sequences, 2) human sequences were not stationary, showing\ndecreasing values of complexity resulting from fatigue, 3) each individual\nshowed traces of algorithmic stability since fitting of partial sequences was\nmore effective to predict subsequent sequences than average fits. This work\nextends on previous efforts to combine notions of Kolmogorov complexity theory\nand algorithmic information theory to psychology, by explicitly ...\n",
        "submitter": "Sergio Romano",
        "authors": "Sergio Romano, Mariano Sigman, Santiago Figueira",
        "comments": "14 pages, 4 figures",
        "journal-ref": "Papers in Physics 5, 050001 (2013)",
        "doi": "10.4279/PIP.050001",
        "report-no": NaN,
        "categories_x": "q-bio.NC cs.AI",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "update_date": "2013-03-06",
        "authors_parsed": "Romano Sergio; Sigman Mariano; Figueira Santiago",
        "categories_y": "q-bio.NC cs.AI"
    },
    {
        "id": "1304.0844",
        "title": "Coalitional Manipulation for Schulze's Rule",
        "abstract": "  Schulze's rule is used in the elections of a large number of organizations\nincluding Wikimedia and Debian. Part of the reason for its popularity is the\nlarge number of axiomatic properties, like monotonicity and Condorcet\nconsistency, which it satisfies. We identify a potential shortcoming of\nSchulze's rule: it is computationally vulnerable to manipulation. In\nparticular, we prove that computing an unweighted coalitional manipulation\n(UCM) is polynomial for any number of manipulators. This result holds for both\nthe unique winner and the co-winner versions of UCM. This resolves an open\nquestion stated by Parkes and Xia (2012). We also prove that computing a\nweighted coalitional manipulation (WCM) is polynomial for a bounded number of\ncandidates. Finally, we discuss the relation between the unique winner UCM\nproblem and the co-winner UCM problem and argue that they have substantially\ndifferent necessary and sufficient conditions for the existence of a successful\nmanipulation.\n",
        "submitter": "Nina Narodytska",
        "authors": "Serge Gaspers, Thomas Kalinowski, Nina Narodytska, Toby Walsh",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.AI cs.GT",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-04-04",
        "authors_parsed": "Gaspers Serge; Kalinowski Thomas; Narodytska Nina; Walsh Toby",
        "categories_y": "cs.AI cs.GT"
    },
    {
        "id": "1305.564",
        "title": "On the post-quantum security of encrypted key exchange protocols",
        "abstract": "  We investigate the post-quantum security of the encrypted key exchange(EKE)\nprotocols based on some basic physical parameters of ion-trap quantum computer,\nand show that the EKE protocol with a 40-bit password will be secure against a\nquantum adversary with several ion-trap quantum computers. We present a\npassword encrypted no-key protocol to resist middle-man attack, and prove that\nit is also with the post-quantum security. The analysis presented here is\nprobably of general meaning for the security evaluation of various hybrid\ncryptosystems.\n",
        "submitter": "Li Yang",
        "authors": "Li Yang and Rui-Rui Zhou",
        "comments": "14 pages",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "quant-ph cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-06-24",
        "authors_parsed": "Yang Li; Zhou Rui-Rui",
        "categories_y": "quant-ph cs.CR"
    },
    {
        "id": "1305.564",
        "title": "On the post-quantum security of encrypted key exchange protocols",
        "abstract": "  We investigate the post-quantum security of the encrypted key exchange(EKE)\nprotocols based on some basic physical parameters of ion-trap quantum computer,\nand show that the EKE protocol with a 40-bit password will be secure against a\nquantum adversary with several ion-trap quantum computers. We present a\npassword encrypted no-key protocol to resist middle-man attack, and prove that\nit is also with the post-quantum security. The analysis presented here is\nprobably of general meaning for the security evaluation of various hybrid\ncryptosystems.\n",
        "submitter": "Li Yang",
        "authors": "Li Yang and Rui-Rui Zhou",
        "comments": "14 pages",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "quant-ph cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-06-24",
        "authors_parsed": "Yang Li; Zhou Rui-Rui",
        "categories_y": "quant-ph cs.CR"
    },
    {
        "id": "1307.1834",
        "title": "Multiple Vectors Propagation of Epidemics in Complex Networks",
        "abstract": "  This letter investigates the epidemic spreading in two-vectors propagation\nnetwork (TPN). We propose detailed theoretical analysis that allows us to\naccurately calculate the epidemic threshold and outbreak size. It is found that\nthe epidemics can spread across the TPN even if two sub-single-vector\npropagation networks (SPNs) of TPN are well below their respective epidemic\nthresholds. Strong positive degree-degree correlation of nodes in TPN could\nlead to a much lower epidemic threshold and a relatively smaller outbreak size.\nHowever, the average similarity between the neighbors from different SPNs of\nnodes has no effect on the epidemic threshold and outbreak size.\n",
        "submitter": "Dawei Zhao",
        "authors": "Dawei Zhao, Lixiang Li, Haipeng Peng, Qun Luo, Yixian Yang",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "physics.soc-ph cs.SI",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-07-09",
        "authors_parsed": "Zhao Dawei; Li Lixiang; Peng Haipeng; Luo Qun; Yang Yixian",
        "categories_y": "physics.soc-ph cs.SI"
    },
    {
        "id": "1307.1945",
        "title": "Theorema 2.0: A Graphical User Interface for a Mathematical Assistant\n  System",
        "abstract": "  Theorema 2.0 stands for a re-design including a complete re-implementation of\nthe Theorema system, which was originally designed, developed, and implemented\nby Bruno Buchberger and his Theorema group at RISC. In this paper, we present\nthe first prototype of a graphical user interface (GUI) for the new system. It\nheavily relies on powerful interactive capabilities introduced in recent\nreleases of the underlying Mathematica system, most importantly the possibility\nof having dynamic objects connected to interface elements like sliders, menus,\ncheck-boxes, radio-buttons and the like. All these features are fully\nintegrated into the Mathematica programming environment and allow the\nimplementation of a modern user interface.\n",
        "submitter": "EPTCS",
        "authors": "Wolfgang Windsteiger (RISC, JKU Linz, Austria)",
        "comments": "In Proceedings UITP 2012, arXiv:1307.1528",
        "journal-ref": "EPTCS 118, 2013, pp. 72-82",
        "doi": "10.4204/EPTCS.118.5",
        "report-no": NaN,
        "categories_x": "cs.MS cs.HC cs.SC",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-07-09",
        "authors_parsed": "Windsteiger Wolfgang RISC, JKU Linz, Austria",
        "categories_y": "cs.MS cs.HC cs.SC"
    },
    {
        "id": "1307.4101",
        "title": "Decision Making for Inconsistent Expert Judgments Using Negative\n  Probabilities",
        "abstract": "  In this paper we provide a simple random-variable example of inconsistent\ninformation, and analyze it using three different approaches: Bayesian,\nquantum-like, and negative probabilities. We then show that, at least for this\nparticular example, both the Bayesian and the quantum-like approaches have less\nnormative power than the negative probabilities one.\n",
        "submitter": "Jose Acacio de Barros",
        "authors": "J. Acacio de Barros",
        "comments": "14 pages, revised version to appear in the Proceedings of the QI2013\n  (Quantum Interactions) conference",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "stat.OT cs.AI math.ST quant-ph stat.TH",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-09-27",
        "authors_parsed": "de Barros J. Acacio",
        "categories_y": "stat.OT cs.AI math.ST quant-ph stat.TH"
    },
    {
        "id": "1310.1187",
        "title": "Labeled Directed Acyclic Graphs: a generalization of context-specific\n  independence in directed graphical models",
        "abstract": "  We introduce a novel class of labeled directed acyclic graph (LDAG) models\nfor finite sets of discrete variables. LDAGs generalize earlier proposals for\nallowing local structures in the conditional probability distribution of a\nnode, such that unrestricted label sets determine which edges can be deleted\nfrom the underlying directed acyclic graph (DAG) for a given context. Several\nproperties of these models are derived, including a generalization of the\nconcept of Markov equivalence classes. Efficient Bayesian learning of LDAGs is\nenabled by introducing an LDAG-based factorization of the Dirichlet prior for\nthe model parameters, such that the marginal likelihood can be calculated\nanalytically. In addition, we develop a novel prior distribution for the model\nstructures that can appropriately penalize a model for its labeling complexity.\nA non-reversible Markov chain Monte Carlo algorithm combined with a greedy hill\nclimbing approach is used for illustrating the useful properties of LDAG models\nfor both real and synthetic data sets.\n",
        "submitter": "Johan Pensar",
        "authors": "Johan Pensar, Henrik Nyman, Timo Koski and Jukka Corander",
        "comments": "26 pages, 17 figures",
        "journal-ref": NaN,
        "doi": "10.1007/s10618-014-0355-0",
        "report-no": NaN,
        "categories_x": "stat.ML cs.AI cs.LG",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2014-11-12",
        "authors_parsed": "Pensar Johan; Nyman Henrik; Koski Timo; Corander Jukka",
        "categories_y": "stat.ML cs.AI cs.LG"
    },
    {
        "id": "1310.1545",
        "title": "Learning Hidden Structures with Relational Models by Adequately\n  Involving Rich Information in A Network",
        "abstract": "  Effectively modelling hidden structures in a network is very practical but\ntheoretically challenging. Existing relational models only involve very limited\ninformation, namely the binary directional link data, embedded in a network to\nlearn hidden networking structures. There is other rich and meaningful\ninformation (e.g., various attributes of entities and more granular information\nthan binary elements such as \"like\" or \"dislike\") missed, which play a critical\nrole in forming and understanding relations in a network. In this work, we\npropose an informative relational model (InfRM) framework to adequately involve\nrich information and its granularity in a network, including metadata\ninformation about each entity and various forms of link data. Firstly, an\neffective metadata information incorporation method is employed on the prior\ninformation from relational models MMSB and LFRM. This is to encourage the\nentities with similar metadata information to have similar hidden structures.\nSecondly, we propose various solutions to cater for alternative forms of link\ndata. Substantial efforts have been made towards modelling appropriateness and\nefficiency, for example, using conjugate priors. We evaluate our framework and\nits inference algorithms in different datasets, which shows the generality and\neffectiveness of our models in capturing implicit structures in networks.\n",
        "submitter": "Xuhui Fan",
        "authors": "Xuhui Fan, Richard Yi Da Xu, Longbing Cao, Yin Song",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.LG cs.SI stat.ML",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-10-08",
        "authors_parsed": "Fan Xuhui; Da Xu Richard Yi; Cao Longbing; Song Yin",
        "categories_y": "cs.LG cs.SI stat.ML"
    },
    {
        "id": "1310.1651",
        "title": "Ethical Considerations when Employing Fake Identities in OSN for\n  Research",
        "abstract": "  Online Social Networks (OSNs) have rapidly become a prominent and widely used\nservice, offering a wealth of personal and sensitive information with\nsignificant security and privacy implications. Hence, OSNs are also an\nimportant - and popular - subject for research. To perform research based on\nreal-life evidence, however, researchers may need to access OSN data, such as\ntexts and files uploaded by users and connections among users. This raises\nsignificant ethical problems. Currently, there are no clear ethical guidelines,\nand researchers may end up (unintentionally) performing ethically questionable\nresearch, sometimes even when more ethical research alternatives exist. For\nexample, several studies have employed `fake identities` to collect data from\nOSNs, but fake identities may be used for attacks and are considered a security\nissue. Is it legitimate to use fake identities for studying OSNs or for\ncollecting OSN data for research? We present a taxonomy of the ethical\nchallenges facing researchers of OSNs and compare different approaches. We\ndemonstrate how ethical considerations have been taken into account in previous\nstudies that used fake identities. In addition, several possible approaches are\noffered to reduce or avoid ethical misconducts. We hope this work will\nstimulate the development and use of ethical practices and methods in the\nresearch of online social networks.\n",
        "submitter": "Haya Shulman",
        "authors": "Yuval Elovici and Michael Fire and Amir Herzberg and Haya Shulman",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "cs.CY cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-10-09",
        "authors_parsed": "Elovici Yuval; Fire Michael; Herzberg Amir; Shulman Haya",
        "categories_y": "cs.CY cs.CR"
    },
    {
        "id": "1311.0707",
        "title": "Generative Modelling for Unsupervised Score Calibration",
        "abstract": "  Score calibration enables automatic speaker recognizers to make\ncost-effective accept / reject decisions. Traditional calibration requires\nsupervised data, which is an expensive resource. We propose a 2-component GMM\nfor unsupervised calibration and demonstrate good performance relative to a\nsupervised baseline on NIST SRE'10 and SRE'12. A Bayesian analysis demonstrates\nthat the uncertainty associated with the unsupervised calibration parameter\nestimates is surprisingly small.\n",
        "submitter": "Niko Br\\\"ummer",
        "authors": "Niko Br\\\"ummer and Daniel Garcia-Romero",
        "comments": "Accepted for ICASSP 2014",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "stat.ML cs.LG",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2014-02-17",
        "authors_parsed": "Brümmer Niko; Garcia-Romero Daniel",
        "categories_y": "stat.ML cs.LG"
    },
    {
        "id": "1311.4547",
        "title": "True randomness from realistic quantum devices",
        "abstract": "  Even if the output of a Random Number Generator (RNG) is perfectly uniformly\ndistributed, it may be correlated to pre-existing information and therefore be\npredictable. Statistical tests are thus not sufficient to guarantee that an RNG\nis usable for applications, e.g., in cryptography or gambling, where\nunpredictability is important. To enable such applications a stronger notion of\nrandomness, termed \"true randomness\", is required, which includes independence\nfrom prior information.\n  Quantum systems are particularly suitable for true randomness generation, as\ntheir unpredictability can be proved based on physical principles. Practical\nimplementations of Quantum RNGs (QRNGs) are however always subject to noise,\ni.e., influences which are not fully controlled. This reduces the quality of\nthe raw randomness generated by the device, making it necessary to post-process\nit. Here we provide a framework to analyse realistic QRNGs and to determine the\npost-processing that is necessary to turn their raw output into true\nrandomness.\n",
        "submitter": "Daniela Frauchiger",
        "authors": "Daniela Frauchiger and Renato Renner and Matthias Troyer",
        "comments": "12 pages + appendix; see ancillary files for extractor software",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories_x": "quant-ph cs.CR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-11-20",
        "authors_parsed": "Frauchiger Daniela; Renner Renato; Troyer Matthias",
        "categories_y": "quant-ph cs.CR"
    }
]