[
    {
        "id": "705.2227",
        "title": "Conditions for the Quantum to Classical Transition: Trajectories vs.\n  Phase Space Distributions",
        "abstract": "  We contrast two sets of conditions that govern the transition in which\nclassical dynamics emerges from the evolution of a quantum system. The first\nwas derived by considering the trajectories seen by an observer (dubbed the\n``strong'' transition) [Bhattacharya, et al., Phys. Rev. Lett. 85: 4852\n(2000)], and the second by considering phase-space densities (the ``weak''\ntransition) [Greenbaum, et al., Chaos 15, 033302 (2005)]. On the face of it\nthese conditions appear rather different. We show, however, that in the\nsemiclassical regime, in which the action of the system is large compared to\n$\\hbar$, and the measurement noise is small, they both offer an essentially\nequivalent local picture. Within this regime, the weak conditions dominate\nwhile in the opposite regime where the action is not much larger than Planck's\nconstant, the strong conditions dominate.\n",
        "submitter": "Kurt Jacobs",
        "authors": "Benjamin D. Greenbaum, Kurt Jacobs, Bala Sundaram",
        "comments": "8 pages, 2 eps figures",
        "journal-ref": "Phys. Rev. E 76, 036213 (2007)",
        "doi": "10.1103/PhysRevE.76.036213",
        "report-no": NaN,
        "categories": "quant-ph",
        "license": NaN,
        "update_date": "2009-11-13",
        "authors_parsed": "Greenbaum Benjamin D.; Jacobs Kurt; Sundaram Bala"
    },
    {
        "id": "706.1198",
        "title": "Spectral plots and the representation and interpretation of biological\n  data",
        "abstract": "  It is basic question in biology and other fields to identify the char-\nacteristic properties that on one hand are shared by structures from a\nparticular realm, like gene regulation, protein-protein interaction or neu- ral\nnetworks or foodwebs, and that on the other hand distinguish them from other\nstructures. We introduce and apply a general method, based on the spectrum of\nthe normalized graph Laplacian, that yields repre- sentations, the spectral\nplots, that allow us to find and visualize such properties systematically. We\npresent such visualizations for a wide range of biological networks and compare\nthem with those for networks derived from theoretical schemes. The differences\nthat we find are quite striking and suggest that the search for universal\nproperties of biological networks should be complemented by an understanding of\nmore specific features of biological organization principles at different\nscales.\n",
        "submitter": "Anirban Banerjee",
        "authors": "Anirban Banerjee and J\\\"urgen Jost",
        "comments": "15 pages, 7 figures",
        "journal-ref": "Theory in Biosciences, 126(1), 15-21, (2007)",
        "doi": "10.1007/s12064-007-0005-9",
        "report-no": NaN,
        "categories": "q-bio.QM",
        "license": NaN,
        "update_date": "2012-10-19",
        "authors_parsed": "Banerjee Anirban; Jost Jürgen"
    },
    {
        "id": "707.2753",
        "title": "Extreme statistics for time series: Distribution of the maximum relative\n  to the initial value",
        "abstract": "  The extreme statistics of time signals is studied when the maximum is\nmeasured from the initial value. In the case of independent, identically\ndistributed (iid) variables, we classify the limiting distribution of the\nmaximum according to the properties of the parent distribution from which the\nvariables are drawn. Then we turn to correlated periodic Gaussian signals with\na 1/f^alpha power spectrum and study the distribution of the maximum relative\nheight with respect to the initial height (MRH_I). The exact MRH_I distribution\nis derived for alpha=0 (iid variables), alpha=2 (random walk), alpha=4 (random\nacceleration), and alpha=infinity (single sinusoidal mode). For other,\nintermediate values of alpha, the distribution is determined from simulations.\nWe find that the MRH_I distribution is markedly different from the previously\nstudied distribution of the maximum height relative to the average height for\nall alpha. The two main distinguishing features of the MRH_I distribution are\nthe much larger weight for small relative heights and the divergence at zero\nheight for alpha>3. We also demonstrate that the boundary conditions affect the\nshape of the distribution by presenting exact results for some non-periodic\nboundary conditions. Finally, we show that, for signals arising from\ntime-translationally invariant distributions, the density of near extreme\nstates is the same as the MRH_I distribution. This is used in developing a\nscaling theory for the threshold singularities of the two distributions.\n",
        "submitter": "Zoltan Racz",
        "authors": "T. W. Burkhardt (Temple University), G. Gyorgyi, N. R. Moloney, Z.\n  Racz (Eotvos University)",
        "comments": "29 pages, 4 figures",
        "journal-ref": NaN,
        "doi": "10.1103/PhysRevE.76.041119",
        "report-no": NaN,
        "categories": "cond-mat.stat-mech",
        "license": NaN,
        "update_date": "2009-11-13",
        "authors_parsed": "Burkhardt T. W. Temple University; Gyorgyi G. Eotvos University; Moloney N. R. Eotvos University; Racz Z. Eotvos University"
    },
    {
        "id": "710.5497",
        "title": "Multifractality in the Random Parameters Model",
        "abstract": "  The Random Parameters model was proposed to explain the structure of the\ncovariance matrix in problems where most, but not all, of the eigenvalues of\nthe covariance matrix can be explained by Random Matrix Theory. In this\narticle, we explore other properties of the model, like the scaling of its PDF\nas one take larger scales. Special attention is given to the multifractal\nstructure of the model time series, which revealed a scaling structure\ncompatible with the known stylized facts for a reasonable choice of the\nparameter values.\n",
        "submitter": "Camilo Rodrigues Neto",
        "authors": "Camilo Rodrigues Neto, Andr\\' e C.R. Martins",
        "comments": "9 pages, 6 figures",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "q-fin.ST physics.soc-ph",
        "license": NaN,
        "update_date": "2008-12-02",
        "authors_parsed": "Neto Camilo Rodrigues; Martins Andr\\' e C. R."
    },
    {
        "id": "711.0629",
        "title": "Distributions of individual Dirac eigenvalues for QCD at non-zero\n  chemical potential: RMT predictions and lattice results",
        "abstract": "  For QCD at non-zero chemical potential $\\mu$, the Dirac eigenvalues are\nscattered in the complex plane. We define a notion of ordering for individual\neigenvalues in this case and derive the distributions of individual eigenvalues\nfrom random matrix theory (RMT). We distinguish two cases depending on the\nparameter $\\alpha=\\mu^2 F^2 V$, where $V$ is the volume and $F$ is the familiar\nlow-energy constant of chiral perturbation theory. For small $\\alpha$, we use a\nFredholm determinant expansion and observe that already the first few terms\ngive an excellent approximation. For large $\\alpha$, all spectral correlations\nare rotationally invariant, and exact results can be derived. We compare the\nRMT predictions to lattice data and in both cases find excellent agreement in\nthe topological sectors $\\nu=0,1,2$.\n",
        "submitter": "Jacques C. R. Bloch",
        "authors": "Gernot Akemann, Jacques Bloch, Leonid Shifrin, and Tilo Wettig",
        "comments": "7 pages, talk given by L. Shifrin at the XXV International Symposium\n  on Lattice Field Theory, Regensburg, Germany, 30 Jul - 4 Aug 2007",
        "journal-ref": "PoS LAT2007:224,2007",
        "doi": NaN,
        "report-no": NaN,
        "categories": "hep-lat",
        "license": NaN,
        "update_date": "2009-01-14",
        "authors_parsed": "Akemann Gernot; Bloch Jacques; Shifrin Leonid; Wettig Tilo"
    },
    {
        "id": "712.003",
        "title": "Glass-forming liquids: One or more \"order\" parameters?",
        "abstract": "  We first summarize the classical arguments that the vast majority of\nglass-forming liquids require more than one \"order\" parameter for their\ndescription. Critiques against this conventional wisdom are then presented, and\nit is argued that the matter deserves to be reconsidered in light of recent\nexperimental developments. Out of the eight basic thermoviscoelastic\nfrequency-dependent response functions, there are generally three independent\nfunctions. For stochastic dynamics we show that there are only two independent\nresponse functions; for this case it is shown how analytic continuation may be\nutilized to express the third response functions in terms of two others.\nOperational criteria are presented for the linear thermoviscoelasticity being\ndescribed by a single \"order\" parameter, in which case there is just one\nindependent thermoviscoelastic response function. It is shown that a single\n\"order\" parameter description applies to a good approximation whenever thermal\nequilibrium fluctuations of fundamental variables like energy and pressure are\nstrongly correlated. Results from computer simulations showing that this is the\ncase for a number of simple glass-forming liquids, as well as a few exceptions,\nare briefly presented. Finally, we discuss a new conjecture according to which\nexperiments at varying temperature and pressure follow the density-scaling\nexpression for the relaxation time, $\\tau=F(\\rho^x/T)$ ($\\rho$ and $T$ are\ndensity and temperature), if and only if the liquid is \"strongly correlating,\"\ni.e., to a good approximation is described by a single \"order\" parameter.\n",
        "submitter": "Jeppe C. Dyre",
        "authors": "Nicholas P. Bailey, Tage Christensen, Bo Jakobsen, Kristine Niss,\n  Niels Boye Olsen, Ulf R. Pedersen, Thomas B. Schr{\\o}der, and Jeppe C. Dyre",
        "comments": NaN,
        "journal-ref": "J. Phys.: Condens. Matter 20, 244113 (2008),",
        "doi": "10.1088/0953-8984/20/24/244113",
        "report-no": NaN,
        "categories": "cond-mat.soft",
        "license": NaN,
        "update_date": "2009-11-13",
        "authors_parsed": "Bailey Nicholas P.; Christensen Tage; Jakobsen Bo; Niss Kristine; Olsen Niels Boye; Pedersen Ulf R.; Schrøder Thomas B.; Dyre Jeppe C."
    },
    {
        "id": "801.319",
        "title": "Cluster sum rules for three-body systems with angular-momentum dependent\n  interactions",
        "abstract": "  We derive general expressions for non-energy weighted and energy-weighted\ncluster sum rules for systems of three charged particles. The interferences\nbetween pairs of particles are found to play a substantial role. The\nenergy-weighted sum rule is usually determined by the kinetic energy operator,\nbut we demonstrate that it has similar additional contributions from the\nangular momentum and parity dependence of two- and three-body potentials\nfrequently used in three-body calculations. The importance of the different\ncontributions is illustrated with the dipole excitations in $^6$He. The results\nare compared with the available experimental data.\n",
        "submitter": "Raul de Diego",
        "authors": "R. de Diego, E. Garrido, A.S. Jensen and D.V. Fedorov",
        "comments": "11 pages, 3 figures, 2 tables",
        "journal-ref": "Phys.Rev.C77:024001,2008",
        "doi": "10.1103/PhysRevC.77.024001",
        "report-no": NaN,
        "categories": "nucl-th",
        "license": NaN,
        "update_date": "2008-11-26",
        "authors_parsed": "de Diego R.; Garrido E.; Jensen A. S.; Fedorov D. V."
    },
    {
        "id": "801.3751",
        "title": "Higher Accuracy for Bayesian and Frequentist Inference: Large Sample\n  Theory for Small Sample Likelihood",
        "abstract": "  Recent likelihood theory produces $p$-values that have remarkable accuracy\nand wide applicability. The calculations use familiar tools such as maximum\nlikelihood values (MLEs), observed information and parameter rescaling. The\nusual evaluation of such $p$-values is by simulations, and such simulations do\nverify that the global distribution of the $p$-values is uniform(0, 1), to high\naccuracy in repeated sampling. The derivation of the $p$-values, however,\nasserts a stronger statement, that they have a uniform(0, 1) distribution\nconditionally, given identified precision information provided by the data. We\ntake a simple regression example that involves exact precision information and\nuse large sample techniques to extract highly accurate information as to the\nstatistical position of the data point with respect to the parameter:\nspecifically, we examine various $p$-values and Bayesian posterior survivor\n$s$-values for validity. With observed data we numerically evaluate the various\n$p$-values and $s$-values, and we also record the related general formulas. We\nthen assess the numerical values for accuracy using Markov chain Monte Carlo\n(McMC) methods. We also propose some third-order likelihood-based procedures\nfor obtaining means and variances of Bayesian posterior distributions, again\nfollowed by McMC assessment. Finally we propose some adaptive McMC methods to\nimprove the simulation acceptance rates. All these methods are based on\nasymptotic analysis that derives from the effect of additional data. And the\nmethods use simple calculations based on familiar maximizing values and related\ninformations. The example illustrates the general formulas and the ease of\ncalculations, while the McMC assessments demonstrate the numerical validity of\nthe $p$-values as percentage position of a data point. The example, however, is\nvery simple and transparent, and thus gives little indication that in a wide\ngenerality of models the formulas do accurately separate information for almost\nany parameter of interest, and then do give accurate $p$-value determinations\nfrom that information. As illustration an enigmatic problem in the literature\nis discussed and simulations are recorded; various examples in the literature\nare cited.\n",
        "submitter": "D. A. S. Fraser",
        "authors": "M. B\\'edard, D. A. S. Fraser, A. Wong",
        "comments": "Published in at http://dx.doi.org/10.1214/07-STS240 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)",
        "journal-ref": "Statistical Science 2007, Vol. 22, No. 3, 301-321",
        "doi": "10.1214/07-STS240",
        "report-no": "IMS-STS-STS240",
        "categories": "stat.ME",
        "license": NaN,
        "update_date": "2008-02-08",
        "authors_parsed": "Bédard M.; Fraser D. A. S.; Wong A."
    },
    {
        "id": "804.3152",
        "title": "Bayesian computation for statistical models with intractable normalizing\n  constants",
        "abstract": "  This paper deals with some computational aspects in the Bayesian analysis of\nstatistical models with intractable normalizing constants. In the presence of\nintractable normalizing constants in the likelihood function, traditional MCMC\nmethods cannot be applied. We propose an approach to sample from such posterior\ndistributions. The method can be thought as a Bayesian version of the MCMC-MLE\napproach of Geyer and Thompson (1992). To the best of our knowledge, this is\nthe first general and asymptotically consistent Monte Carlo method for such\nproblems. We illustrate the method with examples from image segmentation and\nsocial network modeling. We study as well the asymptotic behavior of the\nalgorithm and obtain a strong law of large numbers for empirical averages.\n",
        "submitter": "Christian Robert P",
        "authors": "Yves Atchade, Nicolas Lartillot and Christian P. Robert",
        "comments": "20 pages, 4 figures, submitted for publication",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "stat.CO stat.ME",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2008-04-22",
        "authors_parsed": "Atchade Yves; Lartillot Nicolas; Robert Christian P."
    },
    {
        "id": "804.3385",
        "title": "Variations on a theme by Skyrme",
        "abstract": "  We present a survey of the phenomenological adjustment of the parameters of\nthe Skyrme-Hartree-Fock (SHF) model for a self-consistent description of\nnuclear structure and low-energy excitations. A large sample of reliable input\ndata from nuclear bulk properties (energy, radii, surface thickness) is\nselected guided by the criterion that ground-state correlations should remain\nsmall. Least squares fitting techniques are used to determine the SHF\nparameters which accommodate best the given input data. The question of the\npredictive value of the adjustment is scrutinized by performing systematic\nvariations with respect to chosen nuclear matter properties (incompressibility,\neffective mass, symmetry energy, and sum-rule enhancement factor). We find that\nthe ground-state data, although representing a large sample, leave a broad\nrange of choices, i.e. a broad range of nuclear matter properties. Information\nfrom giant resonances is added to pin down more precisely the open features. We\nthen apply the set of newly adjusted parameterizations to several more detailed\nobservables such as neutron skin, isotope shifts, and super-heavy elements. The\ntechniques of least-squares fitting provide safe estimates for the\nuncertainties of such extrapolations. The systematic variation of forces allows\nto disentangle the various influences on a given observable and to estimate the\npredictive value of the SHF model. The results depend very much on the\nobservable under consideration.\n",
        "submitter": "Peter Kluepfel",
        "authors": "P. Kl\\\"upfel, P.--G. Reinhard, T. J. B\\\"urvenich, J. A. Maruhn",
        "comments": "26 pages, 17 figures, 5 tables",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "nucl-th",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2008-11-10",
        "authors_parsed": "Klüpfel P.; Reinhard P. --G.; Bürvenich T. J.; Maruhn J. A."
    },
    {
        "id": "805.0074",
        "title": "A nonparametric estimator of the spectral density of a continuous-time\n  Gaussian process observed at random times",
        "abstract": "  In numerous applications data are observed at random times and an estimated\ngraph of the spectral density may be relevant for characterizing and explaining\nphenomena. By using a wavelet analysis, one derives a nonparametric estimator\nof the spectral density of a Gaussian process with stationary increments (or a\nstationary Gaussian process) from the observation of one path at random\ndiscrete times. For every positive frequency, this estimator is proved to\nsatisfy a central limit theorem with a convergence rate depending on the\nroughness of the process and the moment of random durations between successive\nobservations. In the case of stationary Gaussian processes, one can compare\nthis estimator with estimators based on the empirical periodogram. Both\nestimators reach the same optimal rate of convergence, but the estimator based\non wavelet analysis converges for a different class of random times. Simulation\nexamples and application to biological data are also provided.\n",
        "submitter": "Jean-Marc Bardet",
        "authors": "Jean-Marc Bardet (CES, SAMOS), Pierre Bertrand (LMA-Clermont)",
        "comments": "Scandinavian Journal of Statistics To appear (2010) 1-41",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "math.ST stat.TH",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-11-27",
        "authors_parsed": "Bardet Jean-Marc CES, SAMOS; Bertrand Pierre LMA-Clermont"
    },
    {
        "id": "807.4473",
        "title": "Dynamics and self-similarity in min-driven clustering",
        "abstract": "  We study a mean-field model for a clustering process that may be described\ninformally as follows. At each step a random integer $k$ is chosen with\nprobability $p_k$, and the smallest cluster merges with $k$ randomly chosen\nclusters. We prove that the model determines a continuous dynamical system on\nthe space of probability measures supported in $(0,\\infty)$, and we establish\nnecessary and sufficient conditions for approach to self-similar form. We also\ncharacterize eternal solutions for this model via a Levy-Khintchine formula.\nThe analysis is based on an explicit solution formula discovered by Gallay and\nMielke, extended using a careful choice of time scale.\n",
        "submitter": "Govind Menon",
        "authors": "Govind Menon, Barbara Niethammer, and Robert L. Pego",
        "comments": NaN,
        "journal-ref": "Trans. Amer. Math. Soc., 362 (2010), 6591-6618",
        "doi": "10.1090/S0002-9947-2010-05085-8",
        "report-no": NaN,
        "categories": "nlin.AO",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-05-16",
        "authors_parsed": "Menon Govind; Niethammer Barbara; Pego Robert L."
    },
    {
        "id": "901.3418",
        "title": "Time-dependent density functional theory of high excitations: To\n  infinity, and beyond",
        "abstract": "  We review the theoretical background for obtaining both quantum defects and\nscattering phase shifts from time-dependent density functional theory. The\nquantum defect on the negative energy side of the spectrum and the phase shift\non the positive energy side merge continuously at E=0, allowing both to be\nfound by the same method. We illustrate with simple one-dimensional examples:\nthe spherical well and the delta well potential. As an example of a real\nsystem, we study in detail elastic electron scattering from the He${}^{+}$ ion.\nWe show how the results are influenced by different approximations to the\nunknown components in (time-dependent) density functional theory: the ground\nstate exchange-correlation potential and time-dependent kernel. We also revisit\nour previously obtained results for $e$-H scattering. Our results are\nremarkably accurate in may cases, but fail qualitatively in others.\n",
        "submitter": "Meta van Faassen",
        "authors": "Meta van Faassen and Kieron Burke",
        "comments": "Resubmitted version, Changed acknowledgments, 17 pages including\n  supplementary table, submitted to PCCP themed issue on time-dependent\n  density-functional theory",
        "journal-ref": NaN,
        "doi": "10.1039/b901402k",
        "report-no": NaN,
        "categories": "cond-mat.other",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2019-03-27",
        "authors_parsed": "van Faassen Meta; Burke Kieron"
    },
    {
        "id": "901.3436",
        "title": "Asymptotics of eigenvalues and eigenvectors of Toeplitz matrices",
        "abstract": "  A Toeplitz matrix is one in which the matrix elements are constant along\ndiagonals. The Fisher-Hartwig matrices are much-studied singular matrices in\nthe Toeplitz family. The matrices are defined for all orders, $N$. They are\nparametrized by two constants, $\\alpha$ and $\\beta$. Their spectrum of\neigenvalues has a simple asymptotic form in the limit as $N$ goes to infinity.\nHere we study the structure of their eigenvalues and eigenvectors in this\nlimiting case. We specialize to the case $0<\\alpha<|\\beta|<1$, where the\nbehavior is particularly simple.\n",
        "submitter": "Hui Dai",
        "authors": "Hui Dai, Zachary Geary, Leo P. Kadanoff",
        "comments": "27 pages, 13 figures, 4 tables",
        "journal-ref": NaN,
        "doi": "10.1088/1742-5468/2009/05/P05012",
        "report-no": NaN,
        "categories": "math-ph math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-13",
        "authors_parsed": "Dai Hui; Geary Zachary; Kadanoff Leo P."
    },
    {
        "id": "902.1265",
        "title": "On the generalized eigenvalue method for energies and matrix elements in\n  lattice field theory",
        "abstract": "  We discuss the generalized eigenvalue problem for computing energies and\nmatrix elements in lattice gauge theory, including effective theories such as\nHQET. It is analyzed how the extracted effective energies and matrix elements\nconverge when the time separations are made large. This suggests a particularly\nefficient application of the method for which we can prove that corrections\nvanish asymptotically as $\\exp(-(E_{N+1}-E_n) t)$. The gap $E_{N+1}-E_n$ can be\nmade large by increasing the number $N$ of interpolating fields in the\ncorrelation matrix. We also show how excited state matrix elements can be\nextracted such that contaminations from all other states disappear\nexponentially in time. As a demonstration we present numerical results for the\nextraction of ground state and excited B-meson masses and decay constants in\nstatic approximation and to order $1/m_b$ in HQET.\n",
        "submitter": "Georg von Hippel",
        "authors": "Benoit Blossier, Michele Della Morte, Georg von Hippel, Tereza Mendes,\n  Rainer Sommer",
        "comments": "(1+28) pages, 9 figures; minor corrections to table 1 and figures,\n  main results unaffected",
        "journal-ref": "JHEP 0904:094,2009",
        "doi": "10.1088/1126-6708/2009/04/094",
        "report-no": "DESY 09-014, SFB/CPP-09-10, MKPH-T-09-01, LPT-Orsay/09-05",
        "categories": "hep-lat",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2009-04-30",
        "authors_parsed": "Blossier Benoit; Della Morte Michele; von Hippel Georg; Mendes Tereza; Sommer Rainer"
    },
    {
        "id": "908.3944",
        "title": "Trace Formulae and Spectral Statistics for Discrete Laplacians on\n  Regular Graphs (I)",
        "abstract": "  Trace formulae for d-regular graphs are derived and used to express the\nspectral density in terms of the periodic walks on the graphs under\nconsideration. The trace formulae depend on a parameter w which can be tuned\ncontinuously to assign different weights to different periodic orbit\ncontributions. At the special value w=1, the only periodic orbits which\ncontribute are the non back- scattering orbits, and the smooth part in the\ntrace formula coincides with the Kesten-McKay expression. As w deviates from\nunity, non vanishing weights are assigned to the periodic walks with\nback-scatter, and the smooth part is modified in a consistent way. The trace\nformulae presented here are the tools to be used in the second paper in this\nsequence, for showing the connection between the spectral properties of\nd-regular graphs and the theory of random matrices.\n",
        "submitter": "Idan Oren",
        "authors": "Idan Oren, Amit Godel and Uzy Smilansky",
        "comments": "22 pages, 3 figures",
        "journal-ref": NaN,
        "doi": "10.1088/1751-8113/42/41/415101",
        "report-no": NaN,
        "categories": "math-ph math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-14",
        "authors_parsed": "Oren Idan; Godel Amit; Smilansky Uzy"
    },
    {
        "id": "1001.0678",
        "title": "The R-matrix theory",
        "abstract": "  The different facets of the $R$-matrix method are presented pedagogically in\na general framework. Two variants have been developed over the years: $(i)$ The\n\"calculable\" $R$-matrix method is a calculational tool to derive scattering\nproperties from the Schr\\\"odinger equation in a large variety of physical\nproblems. It was developed rather independently in atomic and nuclear physics\nwith too little mutual influence. $(ii)$ The \"phenomenological\" $R$-matrix\nmethod is a technique to parametrize various types of cross sections. It was\nmainly (or uniquely) used in nuclear physics. Both directions are explained by\nstarting from the simple problem of scattering by a potential. They are\nillustrated by simple examples in nuclear and atomic physics. In addition to\nelastic scattering, the $R$-matrix formalism is applied to transfer and\nradiative-capture reactions. We also present more recent and more ambitious\napplications of the theory in nuclear physics.\n",
        "submitter": "Pierre Descouvemont",
        "authors": "P. Descouvemont, D. Baye",
        "comments": "93 pages, 26 figures. Rep. Prog. Phys., in press",
        "journal-ref": NaN,
        "doi": "10.1088/0034-4885/73/3/036301",
        "report-no": NaN,
        "categories": "nucl-th",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-14",
        "authors_parsed": "Descouvemont P.; Baye D."
    },
    {
        "id": "1002.3268",
        "title": "Kinetic equations for systems with long-range interactions: a unified\n  description",
        "abstract": "  We complete the existing literature on the kinetic theory of systems with\nlong-range interactions. Starting from the BBGKY hierarchy, or using projection\noperator technics or a quasilinear theory, a general kinetic equation can be\nderived when collective effects are neglected. This equation (which is not\nwell-known) applies to possibly spatially inhomogeneous systems, which is\nspecific to systems with long-range interactions. Interestingly, the structure\nof this kinetic equation bears a clear physical meaning in terms of generalized\nKubo relations. Furthermore, this equation takes a very similar form for\nstellar systems and two-dimensional point vortices providing therefore a\nunified description of the kinetic theory of these systems. If we assume that\nthe system is spatially homogeneous (or axisymmetric for point vortices), this\nequation can be simplified and reduces to the Landau equation (or its\ncounterpart for point vortices). Our formalism thus offers a simple derivation\nof Landau-type equations. We also use this general formalism to derive a\nkinetic equation, written in angle-action variables, describing spatially\ninhomogeneous systems with long-range interactions. This new derivation solves\nthe shortcomings of our previous derivation [P.H. Chavanis, Physica A 377, 469\n(2007)]. Finally, we consider a test particle approach and derive general\nexpressions for the diffusion and friction (or drift) coefficients of a test\nparticle evolving in a bath of field particles. We make contact with the\nexpressions previously obtained in the literature. As an application of the\nkinetic theory, we argue that the relaxation time is shorter for inhomogeneous\n(or high-dimensional) systems than for homogeneous (or low-dimensional) systems\nbecause there are potentially more resonances.\n",
        "submitter": "Pierre-Henri Chavanis",
        "authors": "Pierre-Henri Chavanis",
        "comments": NaN,
        "journal-ref": "J. Stat. Mech. P05019 (2010)",
        "doi": "10.1088/1742-5468/2010/05/P05019",
        "report-no": NaN,
        "categories": "cond-mat.stat-mech",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-18",
        "authors_parsed": "Chavanis Pierre-Henri"
    },
    {
        "id": "1002.452",
        "title": "Entropy production and coarse-graining in Markov processes",
        "abstract": "  We study the large time fluctuations of entropy production in Markov\nprocesses. In particular, we consider the effect of a coarse-graining procedure\nwhich decimates {\\em fast states} with respect to a given time threshold. Our\nresults provide strong evidence that entropy production is not directly\naffected by this decimation, provided that it does not entirely remove loops\ncarrying a net probability current. After the study of some examples of random\nwalks on simple graphs, we apply our analysis to a network model for the\nkinesin cycle, which is an important biomolecular motor. A tentative general\ntheory of these facts, based on Schnakenberg's network theory, is proposed.\n",
        "submitter": "Andrea Puglisi",
        "authors": "A. Puglisi, S. Pigolotti, L. Rondoni, A. Vulpiani",
        "comments": "18 pages, 13 figures, submitted for publication",
        "journal-ref": "J. Stat. Mech. (2010) P05015",
        "doi": "10.1088/1742-5468/2010/05/P05015",
        "report-no": NaN,
        "categories": "cond-mat.stat-mech",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-05-21",
        "authors_parsed": "Puglisi A.; Pigolotti S.; Rondoni L.; Vulpiani A."
    },
    {
        "id": "1004.1635",
        "title": "Summation of Parquet diagrams as an ab initio method in nuclear\n  structure calculations",
        "abstract": "  In this work we discuss the summation of the Parquet class of diagrams within\nGreen's function theory as a possible framework for ab initio nuclear structure\ncalculations. The theory is presented and some numerical details are discussed,\nin particular the approximations employed. We apply the Parquet method to a\nsimple model, and compare our results with those from an exact solution. The\nmain conclusion is that even at the level of approximation presented here, the\nresults shows good agreement with other comparable ab initio approaches.\n",
        "submitter": "Morten Hjorth-Jensen",
        "authors": "Elise Bergli and M. Hjorth-Jensen",
        "comments": "48 pages, elsevier latex style",
        "journal-ref": "Annals Phys.326:1125-1160,2011",
        "doi": "10.1016/j.aop.2010.09.015",
        "report-no": NaN,
        "categories": "nucl-th quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-04-20",
        "authors_parsed": "Bergli Elise; Hjorth-Jensen M."
    },
    {
        "id": "1004.2557",
        "title": "Bound state spectra of the 3D rational potential",
        "abstract": "  We present bound state spectra of the 3D rational potential, $V(r)=r^2 +\n\\lambda r^2/(1+gr^2)$, $g>0$, by means of the generalized pseudospectral\nmethod. All the thirty states corresponding to $n$=0--9 are considered for the\nfirst time for a broad range of coupling parameters. These results surpass the\naccuracy of \\emph{all} other existing calculations published so far except the\nfinite-difference method, which yields similar accuracy as ours. Variation of\nenergies and radial distribution functions is followed with respect to the\ninteraction parameters. Special emphasis has been laid on \\emph{higher}\nexcitations and \\emph{negative} values of the interaction, where relatively\nless work has been reported. The energy sequence is found to be different for\npositive and negative interaction; numerically following a mirror-image\nrelationship \\emph{usually}, if not always. Additionally, twenty energy\nsplittings arising from certain levels belonging to $n$=0--9 are systematically\nstudied as functions of the potential parameters. Several new states (including\nthe higher ones) are presented.\n",
        "submitter": "Amlan Kusum Roy",
        "authors": "Amlan K. Roy, Abraham F. Jalbout and Emil I. Proynov",
        "comments": "15 pages, 5 tables, 2 figures, 55 references",
        "journal-ref": "international journal of quantum chemistry, 108, 827-836, 2008",
        "doi": "10.1002/qua.21571",
        "report-no": NaN,
        "categories": "quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-18",
        "authors_parsed": "Roy Amlan K.; Jalbout Abraham F.; Proynov Emil I."
    },
    {
        "id": "1006.4848",
        "title": "Power Spectrum Analysis of BNL Decay-Rate Data",
        "abstract": "  Evidence for an anomalous annual periodicity in certain nuclear decay data\nhas led to speculation concerning a possible solar influence on nuclear\nprocesses. As a test of this hypothesis, we here search for evidence in decay\ndata that might be indicative of a process involving solar rotation, focusing\non data for 32Si and 36Cl decay rates acquired at the Brookhaven National\nLaboratory. Examination of the power spectrum over a range of frequencies (10 -\n15 year^-1) appropriate for solar synodic rotation rates reveals several\nperiodicities, the most prominent being one at 11.18 year^-1 with power 20.76.\nWe evaluate the significance of this peak in terms of the false-alarm\nprobability, by means of the shuffle test, and also by means of a new test (the\n\"shake\" test) that involves small random time displacements. The last two tests\nindicate that the peak at 11.18 year^-1 would arise by chance only once out of\nabout 10^7 trials. Since there are several peaks in the search band, we also\ninvestigate the running mean of the power spectrum, and identify a major peak\nat 11.93 year^-1 with peak running-mean power 4.08. Application of the shuffle\ntest and the shake test indicates that there is less than one chance in 10^11,\nand one chance in 10^15, respectively, finding by chance a value as large as\n4.08.\n",
        "submitter": "Peter A. Sturrock",
        "authors": "P.A. Sturrock, J.B. Buncher, E. Fischbach, J.T. Gruenwald, D. Javorsek\n  II, J.H. Jenkins, R.H. Lee, J.J. Mattes, J.R. Newport",
        "comments": "12 pages, 17 figures, to be published in Astroparticle Physics",
        "journal-ref": "Astropart.Phys.34:121-127,2010",
        "doi": "10.1016/j.astropartphys.2010.06.004",
        "report-no": NaN,
        "categories": "hep-ph astro-ph.SR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2014-11-21",
        "authors_parsed": "Sturrock P. A.; Buncher J. B.; Fischbach E.; Gruenwald J. T.; Javorsek D. II; Jenkins J. H.; Lee R. H.; Mattes J. J.; Newport J. R."
    },
    {
        "id": "1010.4718",
        "title": "Universal Markovian reduction of Brownian particle dynamics",
        "abstract": "  Non-Markovian processes can often be turned Markovian by enlarging the set of\nvariables. Here we show, by an explicit construction, how this can be done for\nthe dynamics of a Brownian particle obeying the generalized Langevin equation.\nGiven an arbitrary bath spectral density $J_{0}$, we introduce an orthogonal\ntransformation of the bath variables into effective modes, leading stepwise to\na semi-infinite chain with nearest-neighbor interactions. The transformation is\nuniquely determined by $J_{0}$ and defines a sequence\n$\\{J_{n}\\}_{n\\in\\mathbb{N}}$ of residual spectral densities describing the\ninteraction of the terminal chain mode, at each step, with the remaining bath.\nWe derive a simple, one-term recurrence relation for this sequence, and show\nthat its limit is the quasi-Ohmic expression provided by the Rubin model of\ndissipation. Numerical calculations show that, irrespective of the details of\n$J_{0}$, convergence is fast enough to be useful in practice for an effective\nMarkovian reduction of quantum dissipative dynamics.\n",
        "submitter": "Rocco Martinazzo",
        "authors": "Rocco Martinazzo, Bassano Vacchini, Keith H. Hughes and Irene\n  Burghardt",
        "comments": NaN,
        "journal-ref": "J. Chem. Phys. 134, 011101 (2011)",
        "doi": "10.1063/1.3532408",
        "report-no": NaN,
        "categories": "quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-01-26",
        "authors_parsed": "Martinazzo Rocco; Vacchini Bassano; Hughes Keith H.; Burghardt Irene"
    },
    {
        "id": "1012.2242",
        "title": "Are biological systems poised at criticality?",
        "abstract": "  Many of life's most fascinating phenomena emerge from interactions among many\nelements--many amino acids determine the structure of a single protein, many\ngenes determine the fate of a cell, many neurons are involved in shaping our\nthoughts and memories. Physicists have long hoped that these collective\nbehaviors could be described using the ideas and methods of statistical\nmechanics. In the past few years, new, larger scale experiments have made it\npossible to construct statistical mechanics models of biological systems\ndirectly from real data. We review the surprising successes of this \"inverse\"\napproach, using examples form families of proteins, networks of neurons, and\nflocks of birds. Remarkably, in all these cases the models that emerge from the\ndata are poised at a very special point in their parameter space--a critical\npoint. This suggests there may be some deeper theoretical principle behind the\nbehavior of these diverse systems.\n",
        "submitter": "Thierry Mora",
        "authors": "Thierry Mora and William Bialek",
        "comments": "21 pages",
        "journal-ref": "J Stat Phys (2011) 144:268-302",
        "doi": "10.1007/s10955-011-0229-4",
        "report-no": NaN,
        "categories": "q-bio.QM cond-mat.dis-nn cond-mat.stat-mech nlin.AO physics.bio-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-11-28",
        "authors_parsed": "Mora Thierry; Bialek William"
    },
    {
        "id": "1012.5987",
        "title": "When are correlations strong?",
        "abstract": "  The inverse problem of statistical mechanics involves finding the minimal\nHamiltonian that is consistent with some observed set of correlation functions.\nThis problem has received renewed interest in the analysis of biological\nnetworks; in particular, several such networks have been described successfully\nby maximum entropy models consistent with pairwise correlations. These\ncorrelations are usually weak in an absolute sense (e.g., correlation\ncoefficients ~ 0.1 or less), and this is sometimes taken as evidence against\nthe existence of interesting collective behavior in the network. If\ncorrelations are weak, it should be possible to capture their effects in\nperturbation theory, so we develop an expansion for the entropy of Ising\nsystems in powers of the correlations, carrying this out to fourth order. We\nthen consider recent work on networks of neurons [Schneidman et al., Nature\n440, 1007 (2006); Tkacik et al., arXiv:0912.5409 [q-bio.NC] (2009)], and show\nthat even though all pairwise correlations are weak, the fact that these\ncorrelations are widespread means that their impact on the network as a whole\nis not captured in the leading orders of perturbation theory. More positively,\nthis means that recent successes of maximum entropy approaches are not simply\nthe result of correlations being weak.\n",
        "submitter": "Feraz Azhar",
        "authors": "Feraz Azhar, William Bialek",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "q-bio.NC cond-mat.dis-nn cond-mat.stat-mech physics.data-an",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2010-12-30",
        "authors_parsed": "Azhar Feraz; Bialek William"
    },
    {
        "id": "1102.2402",
        "title": "Elastic Network Models: Theoretical and Empirical Foundations",
        "abstract": "  Fifteen years ago Monique Tirion showed that the low-frequency normal modes\nof a protein are not significantly altered when non-bonded interactions are\nreplaced by Hookean springs, for all atom pairs whose distance is smaller than\na given cutoff value. Since then, it has been shown that coarse-grained\nversions of Tirion's model are able to provide fair insights on many dynamical\nproperties of biological macromolecules. In this text, theoretical tools\nrequired for studying these so-called Elastic Network Models are described,\nfocusing on practical issues and, in particular, on possible artifacts. Then,\nan overview of some typical results that have been obtained by studying such\nmodels is given.\n",
        "submitter": "Yves-Henri Sanejouand",
        "authors": "Yves-Henri Sanejouand",
        "comments": "26 pages, 1 Figure",
        "journal-ref": "in \"Biomolecular Simulations\", Monticelli and Salonen eds, Humana\n  Press, p601, 2012",
        "doi": NaN,
        "report-no": NaN,
        "categories": "q-bio.BM",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-10-19",
        "authors_parsed": "Sanejouand Yves-Henri"
    },
    {
        "id": "1104.4513",
        "title": "Tail bounds for all eigenvalues of a sum of random matrices",
        "abstract": "  This work introduces the minimax Laplace transform method, a modification of\nthe cumulant-based matrix Laplace transform method developed in \"User-friendly\ntail bounds for sums of random matrices\" (arXiv:1004.4389v6) that yields both\nupper and lower bounds on each eigenvalue of a sum of random self-adjoint\nmatrices. This machinery is used to derive eigenvalue analogues of the\nclassical Chernoff, Bennett, and Bernstein bounds.\n  Two examples demonstrate the efficacy of the minimax Laplace transform. The\nfirst concerns the effects of column sparsification on the spectrum of a matrix\nwith orthonormal rows. Here, the behavior of the singular values can be\ndescribed in terms of coherence-like quantities. The second example addresses\nthe question of relative accuracy in the estimation of eigenvalues of the\ncovariance matrix of a random process. Standard results on the convergence of\nsample covariance matrices provide bounds on the number of samples needed to\nobtain relative accuracy in the spectral norm, but these results only guarantee\nrelative accuracy in the estimate of the maximum eigenvalue. The minimax\nLaplace transform argument establishes that if the lowest eigenvalues decay\nsufficiently fast, on the order of (K^2*r*log(p))/eps^2 samples, where K is the\ncondition number of an optimal rank-r approximation to C, are sufficient to\nensure that the dominant r eigenvalues of the covariance matrix of a N(0, C)\nrandom vector are estimated to within a factor of 1+-eps with high probability.\n",
        "submitter": "Alex Gittens",
        "authors": "Alex Gittens and Joel A. Tropp",
        "comments": "20 pages, 1 figure, see also arXiv:1004.4389v6",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "math.PR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-07-22",
        "authors_parsed": "Gittens Alex; Tropp Joel A."
    },
    {
        "id": "1106.1678",
        "title": "Analysis of Experiments Exhibiting Time-Varying Nuclear Decay Rates:\n  Systematic Effects or New Physics?",
        "abstract": "  Since the 1930s, and with very few exceptions, it has been assumed that the\nprocess of radioactive decay is a random process, unaffected by the environment\nin which the decaying nucleus resides. There have been instances within the\npast few decades, however, where changes in the chemical environment or\nphysical environment brought about small changes in the decay rates. But even\nin light of these instances, decaying nuclei that were undisturbed or\nun-\"pressured\" were thought to behave in the expected random way, subject to\nthe normal decay probabilities which are specific to each nuclide. Moreover,\nany \"non-random\" behavior was assumed automatically to be the fault of the\ndetection systems, the environment surrounding the detectors, or changes in the\nbackground radiation to which the detector was exposed. Recently, however,\nevidence has emerged from a variety of sources, including measurements taken by\nindependent groups at Brookhaven National Laboratory, Physikalisch-Technische\nBundesanstalt, and Purdue University, that indicate there may in fact be an\ninfluence that is altering nuclear decay rates, albeit at levels on the order\nof $10^{-3}$. In this paper, we will discuss some of these results, and examine\nthe evidence pointing to the conclusion that the intrinsic decay process is\nbeing affected by a solar influence.\n",
        "submitter": "Jere Jenkins",
        "authors": "Jere H. Jenkins, Ephraim Fischbach, Peter A. Sturrock, and Daniel W.\n  Mundy",
        "comments": "6 pages, 2 figures, presented at Moriond 2011, La Thuile, Italy",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "nucl-ex astro-ph.SR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-06-10",
        "authors_parsed": "Jenkins Jere H.; Fischbach Ephraim; Sturrock Peter A.; Mundy Daniel W."
    },
    {
        "id": "1108.5441",
        "title": "Novel Source of Nonlocality in the Optical Model",
        "abstract": "  In this work we fit $neutron$ - $^{12}C$ elastic scattering angular\ndistributions in the energy range 12 to 20 MeV, by adding a velocity dependent\nterm to the optical potential. This term introduces a wave function gradient,\nwhose coefficient is real and position dependent, and which represents a\nnonlocality. We pay special attention to the prominent backscattering minima\nwhich depend sensitively on the incident energies, and which are a tell-tale of\nnonlocalities. Reasonable fits to the analyzing power data are also obtained as\na by-product. All our potentials have the form of conventional Woods - Saxon\nshapes or their derivatives. The number of our parameters (12) is smaller than\nthe number for other local optical potentials, and they vary monotically with\nenergy, while the strengths of the real and imaginary parts of the central\npotential are nearly constants. Our nonlocality is in contrast to other forms\nof nonlocalities introduced previously.\n",
        "submitter": "Mahmoud Jaghoub Prof",
        "authors": "M. I. Jaghoub, M. F. Hassan, G. H. Rawitscher",
        "comments": "19 pages, 6 figures, two tables, manuscript",
        "journal-ref": "Phys. Rev. C 84, 034618 (2011)",
        "doi": "10.1103/PhysRevC.84.034618",
        "report-no": NaN,
        "categories": "nucl-th",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-10-17",
        "authors_parsed": "Jaghoub M. I.; Hassan M. F.; Rawitscher G. H."
    },
    {
        "id": "1109.1576",
        "title": "Accurate calibration of relativistic mean-field models: correlating\n  observables and providing meaningful theoretical uncertainties",
        "abstract": "  Theoretical uncertainties in the predictions of relativistic mean-field\nmodels are estimated using a chi-square minimization procedure that is\nimplemented by studying the small oscillations around the chi-square minimum.\nBy diagonalizing the matrix of second derivatives, one gains access to a wealth\nof information---in the form of powerful correlations---that would normally\nremain hidden. We illustrate the power of the {\\sl covariance analysis} by\nusing two relativistic mean-field models: (a) the original linear Walecka model\nand (b) the accurately calibrated FSUGold parametrization. In addition to\nproviding meaningful theoretical uncertainties for both model parameters and\npredicted observables, the covariance analysis establishes robust correlations\nbetween physical observables. In particular, we show that whereas the\ncorrelation coefficient between the slope of the symmetry energy and the\nneutron-skin thickness of Lead is indeed very large, a 1% measurement of the\nneutron radius of Lead may only be able to constrain the slope of the symmetry\nenergy to about 30%.\n",
        "submitter": "Farrukh Fattoyev Jabborovich",
        "authors": "F. J. Fattoyev and J. Piekarewicz",
        "comments": "15 pages, 3 figures, 3 tables",
        "journal-ref": NaN,
        "doi": "10.1103/PhysRevC.84.064302",
        "report-no": NaN,
        "categories": "nucl-th nucl-ex",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-12-06",
        "authors_parsed": "Fattoyev F. J.; Piekarewicz J."
    },
    {
        "id": "1109.4783",
        "title": "The Kuramoto model with distributed shear",
        "abstract": "  We uncover a solvable generalization of the Kuramoto model in which shears\n(or nonisochronicities) and natural frequencies are distributed and\nstatistically dependent. We show that the strength and sign of this dependence\ngreatly alter synchronization and yield qualitatively different phase diagrams.\nThe Ott-Antonsen ansatz allows us to obtain analytical results for a specific\nfamily of joint distributions. We also derive, using linear stability analysis,\ngeneral formulae for the stability border of incoherence.\n",
        "submitter": "Diego Paz\\'o",
        "authors": "Diego Paz\\'o, Ernest Montbri\\'o",
        "comments": "6 pages",
        "journal-ref": "EPL 95, 60007 (2011)",
        "doi": "10.1209/0295-5075/95/60007",
        "report-no": NaN,
        "categories": "nlin.AO",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2011-09-23",
        "authors_parsed": "Pazó Diego; Montbrió Ernest"
    },
    {
        "id": "1109.536",
        "title": "Order statistics of 1/f^{\\alpha} signals",
        "abstract": "  Order statistics of periodic, Gaussian noise with 1/f^{\\alpha} power spectrum\nis investigated. Using simulations and phenomenological arguments, we find\nthree scaling regimes for the average gap d_k=<x_k-x_{k+1}> between the k-th\nand (k+1)-st largest values of the signal. The result d_k ~ 1/k known for\nindependent, identically distributed variables remains valid for 0<\\alpha<1.\nNontrivial, \\alpha-dependent scaling exponents d_k ~ k^{(\\alpha -3)/2} emerge\nfor 1<\\alpha<5 and, finally, \\alpha-independent scaling, d_k ~ k is obtained\nfor \\alpha>5. The spectra of average ordered values \\epsilon_k=<x_1-x_k> ~\nk^{\\beta} is also examined. The exponent {\\beta} is derived from the gap\nscaling as well as by relating \\epsilon_k to the density of near extreme\nstates. Known results for the density of near extreme states combined with\nscaling suggest that \\beta(\\alpha=2)=1/2, \\beta(4)=3/2, and beta(infinity)=2\nare exact values. We also show that parallels can be drawn between \\epsilon_k\nand the quantum mechanical spectra of a particle in power-law potentials.\n",
        "submitter": "Zoltan Racz",
        "authors": "N. R. Moloney, K. Ozogany, Z. Racz",
        "comments": "8 pages, 5 figures",
        "journal-ref": NaN,
        "doi": "10.1103/PhysRevE.84.061101",
        "report-no": NaN,
        "categories": "cond-mat.stat-mech",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-05-29",
        "authors_parsed": "Moloney N. R.; Ozogany K.; Racz Z."
    },
    {
        "id": "1109.5841",
        "title": "Extreme value distributions and Renormalization Group",
        "abstract": "  In the classical theorems of extreme value theory the limits of suitably\nrescaled maxima of sequences of independent, identically distributed random\nvariables are studied. So far, only affine rescalings have been considered. We\nshow, however, that more general rescalings are natural and lead to new limit\ndistributions, apart from the Gumbel, Weibull, and Fr\\'echet families. The\nproblem is approached using the language of Renormalization Group\ntransformations in the space of probability densities. The limit distributions\nare fixed points of the transformation and the study of the differential around\nthem allows a local analysis of the domains of attraction and the computation\nof finite-size corrections.\n",
        "submitter": "Fernando Falceto",
        "authors": "Iv\\'an Calvo, Juan C. Cuch\\'i, Jos\\'e G. Esteve and Fernando Falceto",
        "comments": "16 pages, 5 figures. Final version",
        "journal-ref": "Phys. Rev. E 86, 041109 (2012)",
        "doi": "10.1103/PhysRevE.86.041109",
        "report-no": NaN,
        "categories": "math-ph cond-mat.stat-mech math.MP physics.comp-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-05-30",
        "authors_parsed": "Calvo Iván; Cuchí Juan C.; Esteve José G.; Falceto Fernando"
    },
    {
        "id": "1111.1159",
        "title": "Geometric spectral inversion for singular potentials",
        "abstract": "  The function E = F(v) expresses the dependence of a discrete eigenvalue E of\nthe Schroedinger Hamiltonian H = -\\Delta + vf(r) on the coupling parameter v.\nWe use envelope theory to generate a functional sequence \\{f^{[k]}(r)\\} to\nreconstruct f(r) from F(v) starting from a seed potential f^{[0]}(r). In the\npower-law or log cases the inversion can be effected analytically and is\ncomplete in just two steps. In other cases convergence is observed numerically.\nTo provide concrete illustrations of the inversion method it is first applied\nto the Hulth\\'en potential, and it is then used to invert spectral data\ngenerated by singular potentials with shapes of the form f(r) = -a/r +\nb\\sgn(q)r^q and f(r) = -a/r + b\\ln(r), a, b > 0. For the class of attractive\ncentral potentials with shapes f(r) = g(r)/r, with g(0)< 0 and g'(r)\\ge 0, we\nprove that the ground-state energy curve F(v) determines f(r) uniquely.\n",
        "submitter": "Richard L. Hall",
        "authors": "Richard L. Hall and Wolfgang Lucha",
        "comments": "13 pages, 5 figures",
        "journal-ref": "J. Math. Phys. 52, 112102 (2011)",
        "doi": "10.1063/1.3657346",
        "report-no": "CUQM - 142, HEPHY - PUB 902/11",
        "categories": "math-ph hep-th math.MP quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-03",
        "authors_parsed": "Hall Richard L.; Lucha Wolfgang"
    },
    {
        "id": "1111.2999",
        "title": "Nelkin scaling for the Burgers equation and the role of high-precision\n  calculations",
        "abstract": "  Nelkin scaling, the scaling of moments of velocity gradients in terms of the\nReynolds number, is an alternative way of obtaining inertial-range information.\nIt is shown numerically and theoretically for the Burgers equation that this\nprocedure works already for Reynolds numbers of the order of 100 (or even lower\nwhen combined with a suitable extended self-similarity technique). At moderate\nReynolds numbers, for the accurate determination of scaling exponents, it is\ncrucial to use higher than double precision. Similar issues are likely to arise\nfor three-dimensional Navier--Stokes simulations.\n",
        "submitter": "Samriddhi Sankar Ray",
        "authors": "Sagar Chakraborty, Uriel Frisch, Walter Pauls, and Samriddhi Sankar\n  Ray",
        "comments": "5 pages, 2 figures, Published in Phys. Rev E (Rapid Communications)",
        "journal-ref": "Physical Review E (Rapid Communications), 85, 015301(R) (2012)",
        "doi": "10.1103/PhysRevE.85.015301",
        "report-no": NaN,
        "categories": "nlin.CD",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-01-26",
        "authors_parsed": "Chakraborty Sagar; Frisch Uriel; Pauls Walter; Ray Samriddhi Sankar"
    },
    {
        "id": "1202.1358",
        "title": "Protein Folding: The Gibbs Free Energy",
        "abstract": "  The fundamental law for protein folding is the Thermodynamic Principle: the\namino acid sequence of a protein determines its native structure and the native\nstructure has the minimum Gibbs free energy. If all chemical problems can be\nanswered by quantum mechanics, there should be a quantum mechanics derivation\nof Gibbs free energy formula G(X) for every possible conformation X of the\nprotein. We apply quantum statistics to derive such a formula. For simplicity,\nonly monomeric self folding globular proteins are covered. We point out some\nimmediate applications of the formula. We show that the formula explains the\nobserved phenomena very well. It gives a unified explanation to both folding\nand denaturation; it explains why hydrophobic effect is the driving force of\nprotein folding and clarifies the role played by hydrogen bonding; it explains\nthe successes and deficients of various surface area models. The formula also\ngives a clear kinetic force of the folding: Fi(X) = - \\nablaxi G(X). This also\ngives a natural way to perform the ab initio prediction of protein structure,\nminimizing G(X) by Newton's fastest desciending method.\n",
        "submitter": "Yi Fang",
        "authors": "Yi Fang",
        "comments": "18 pages, 2 figures",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "q-bio.BM",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-04-10",
        "authors_parsed": "Fang Yi"
    },
    {
        "id": "1202.1789",
        "title": "Levy stable distributions via associated integral transform",
        "abstract": "  We present a method of generation of exact and explicit forms of one-sided,\nheavy-tailed Levy stable probability distributions g_{\\alpha}(x), 0 \\leq x <\n\\infty, 0 < \\alpha < 1. We demonstrate that the knowledge of one such a\ndistribution g_{\\alpha}(x) suffices to obtain exactly g_{\\alpha^{p}}(x), p=2,\n3,... Similarly, from known g_{\\alpha}(x) and g_{\\beta}(x), 0 < \\alpha, \\beta <\n1, we obtain g_{\\alpha \\beta}(x). The method is based on the construction of\nthe integral operator, called Levy transform, which implements the above\noperations. For \\alpha rational, \\alpha = l/k with l < k, we reproduce in this\nmanner many of the recently obtained exact results for g_{l/k}(x). This\napproach can be also recast as an application of the Efros theorem for\ngeneralized Laplace convolutions. It relies solely on efficient definite\nintegration.\n",
        "submitter": "Katarzyna Gorska",
        "authors": "K. Gorska and K. A. Penson",
        "comments": "12 pages, typos removed, references added",
        "journal-ref": "J. Math. Phys. 53, 053302 (2012)",
        "doi": "10.1063/1.4709443",
        "report-no": NaN,
        "categories": "math-ph cond-mat.stat-mech math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-04",
        "authors_parsed": "Gorska K.; Penson K. A."
    },
    {
        "id": "1203.561",
        "title": "Shrinkage Estimation in Multilevel Normal Models",
        "abstract": "  This review traces the evolution of theory that started when Charles Stein in\n1955 [In Proc. 3rd Berkeley Sympos. Math. Statist. Probab. I (1956) 197--206,\nUniv. California Press] showed that using each separate sample mean from\n$k\\ge3$ Normal populations to estimate its own population mean $\\mu_i$ can be\nimproved upon uniformly for every possible $\\mu=(\\mu_1,...,\\mu_k)'$. The\ndominating estimators, referred to here as being \"Model-I minimax,\" can be\nfound by shrinking the sample means toward any constant vector. Admissible\nminimax shrinkage estimators were derived by Stein and others as posterior\nmeans based on a random effects model, \"Model-II\" here, wherein the $\\mu_i$\nvalues have their own distributions. Section 2 centers on Figure 2, which\norganizes a wide class of priors on the unknown Level-II hyperparameters that\nhave been proved to yield admissible Model-I minimax shrinkage estimators in\nthe \"equal variance case.\" Putting a flat prior on the Level-II variance is\nunique in this class for its scale-invariance and for its conjugacy, and it\ninduces Stein's harmonic prior (SHP) on $\\mu_i$.\n",
        "submitter": "Carl N. Morris",
        "authors": "Carl N. Morris, Martin Lysy",
        "comments": "Published in at http://dx.doi.org/10.1214/11-STS363 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)",
        "journal-ref": "Statistical Science 2012, Vol. 27, No. 1, 115-134",
        "doi": "10.1214/11-STS363",
        "report-no": "IMS-STS-STS363",
        "categories": "stat.ME",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-03-27",
        "authors_parsed": "Morris Carl N.; Lysy Martin"
    },
    {
        "id": "1204.1354",
        "title": "Calculating error bars for neutrino mixing parameters",
        "abstract": "  One goal of contemporary particle physics is to determine the mixing angles\nand mass-squared differences that constitute the phenomenological constants\nthat describe neutrino oscillations. Of great interest are not only the best\nfit values of these constants but also their errors. Some of the neutrino\noscillation data is statistically poor and cannot be treated by normal\n(Gaussian) statistics. To extract confidence intervals when the statistics are\nnot normal, one should not utilize the value for chisquare versus confidence\nlevel taken from normal statistics. Instead, we propose that one should use the\nnormalized likelihood function as a probability distribution; the relationship\nbetween the correct chisquare and a given confidence level can be computed by\nintegrating over the likelihood function. This allows for a definition of\nconfidence level independent of the functional form of the !2 function; it is\nparticularly useful for cases in which the minimum of the !2 function is near a\nboundary. We present two pedagogic examples and find that the proposed method\nyields confidence intervals that can differ significantly from those obtained\nby using the value of chisquare from normal statistics. For example, we find\nthat for the first data release of the T2K experiment the probability that\nchisquare is not zero, as defined by the maximum confidence level at which the\nvalue of zero is not allowed, is 92%. Using the value of chisquare at zero and\nassigning a confidence level from normal statistics, a common practice, gives\nthe over estimation of 99.5%.\n",
        "submitter": "David J. Ernst",
        "authors": "H. R. Burroughs, B. K. Cogswell, J. Escamilla-Roa, D. C. Latimer, and\n  D. J. Ernst",
        "comments": "9 pages, 6 figures",
        "journal-ref": NaN,
        "doi": "10.1103/PhysRevC.85.068501",
        "report-no": NaN,
        "categories": "nucl-th hep-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-04",
        "authors_parsed": "Burroughs H. R.; Cogswell B. K.; Escamilla-Roa J.; Latimer D. C.; Ernst D. J."
    },
    {
        "id": "1206.5162",
        "title": "Fast Variational Inference in the Conjugate Exponential Family",
        "abstract": "  We present a general method for deriving collapsed variational inference\nalgo- rithms for probabilistic models in the conjugate exponential family. Our\nmethod unifies many existing approaches to collapsed variational inference. Our\ncollapsed variational inference leads to a new lower bound on the marginal\nlikelihood. We exploit the information geometry of the bound to derive much\nfaster optimization methods based on conjugate gradients for these models. Our\napproach is very general and is easily applied to any model where the mean\nfield update equations have been derived. Empirically we show significant\nspeed-ups for probabilistic models optimized using our bound.\n",
        "submitter": "James Hensman",
        "authors": "James Hensman, Magnus Rattray and Neil D. Lawrence",
        "comments": "Accepted at NIPS 2012",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "cs.LG stat.ML",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2012-12-05",
        "authors_parsed": "Hensman James; Rattray Magnus; Lawrence Neil D."
    },
    {
        "id": "1208.4561",
        "title": "Stationary and Traveling Wave States of the Kuramoto Model with an\n  Arbitrary Distribution of Frequencies and Coupling Strengths",
        "abstract": "  We consider the Kuramoto model of an ensemble of interacting oscillators\nallowing for an arbitrary distribution of frequencies and coupling strengths.\nWe define a family of traveling wave states as stationary in a rotating frame,\nand derive general equations for their parameters. We suggest empirical\nstability conditions which, for the case of incoherence, become exact. In\naddition to making new theoretical predictions, we show that many earlier\nresults follow naturally from our general framework. The results are applicable\nin scientific contexts ranging from physics to biology.\n",
        "submitter": "Dmytro Iatsenko",
        "authors": "Dmytro Iatsenko, Spase Petkoski, Aneta Stefanovska and Peter V. E.\n  McClintock",
        "comments": "5 pages, 1 figure",
        "journal-ref": NaN,
        "doi": "10.1103/PhysRevLett.110.064101",
        "report-no": NaN,
        "categories": "nlin.AO math.DS nlin.CD nlin.PS",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-11",
        "authors_parsed": "Iatsenko Dmytro; Petkoski Spase; Stefanovska Aneta; McClintock Peter V. E."
    },
    {
        "id": "1210.3381",
        "title": "Painleve II in random matrix theory and related fields",
        "abstract": "  We review some occurrences of Painlev\\'e II transcendents in the study of\ntwo-dimensional Yang-Mills theory, fluctuation formulas for growth models, and\nas distribution functions within random matrix theory. We first discuss\nsettings in which the parameter $\\alpha$ in the Painlev\\'e equation is zero,\nand the boundary condition is that of the Hasting-MacLeod solution. As well as\nexpressions involving the Painlev\\'e transcendent itself, one encounters the\nsigma form of the Painlev\\'e II equation, and Lax pair equations in which the\nPainlev\\'e transcendent occurs as coefficients. We then consider settings which\ngive rise to general $\\alpha$ Painlev\\'e II transcendents. In a particular\nrandom matrix setting, new results for the corresponding boundary conditions in\nthe cases $\\alpha = \\pm 1/2$, 1 and 2 are presented.\n",
        "submitter": "Peter Forrester",
        "authors": "Peter J. Forrester and Nicholas S. Witte",
        "comments": "25 pages, prepared for the special issue on Painleve equations in the\n  journal Constructive Approximation",
        "journal-ref": "Constr. Approx., 41, 589-613 (2015)",
        "doi": NaN,
        "report-no": NaN,
        "categories": "math-ph math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-16",
        "authors_parsed": "Forrester Peter J.; Witte Nicholas S."
    },
    {
        "id": "1212.3961",
        "title": "Covariant Lyapunov vectors",
        "abstract": "  The recent years have witnessed a growing interest for covariant Lyapunov\nvectors (CLVs) which span local intrinsic directions in the phase space of\nchaotic systems. Here we review the basic results of ergodic theory, with a\nspecific reference to the implications of Oseledets' theorem for the properties\nof the CLVs. We then present a detailed description of a \"dynamical\" algorithm\nto compute the CLVs and show that it generically converges exponentially in\ntime. We also discuss its numerical performance and compare it with other\nalgorithms presented in literature. We finally illustrate how CLVs can be used\nto quantify deviations from hyperbolicity with reference to a dissipative\nsystem (a chain of H\\'enon maps) and a Hamiltonian model (a Fermi-Pasta-Ulam\nchain).\n",
        "submitter": "Francesco Ginelli",
        "authors": "Francesco Ginelli, Hugues Chate', Roberto Livi, Antonio Politi",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": "10.1088/1751-8113/46/25/254005",
        "report-no": NaN,
        "categories": "nlin.CD cond-mat.stat-mech",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-12",
        "authors_parsed": "Ginelli Francesco; Chate' Hugues; Livi Roberto; Politi Antonio"
    },
    {
        "id": "1301.4893",
        "title": "An Introduction to the Quantum Backflow Effect",
        "abstract": "  We present an introduction to the backflow effect in quantum mechanics -- the\nphenomenon in which a state consisting entirely of positive momenta may have\nnegative current and the probability flows in the opposite direction to the\nmomentum. We show that the effect is present even for simple states consisting\nof superpositions of gaussian wave packets, although the size of the effect is\nsmall. Inspired by the numerical results of Penz et al, we present a wave\nfunction whose current at any time may be computed analytically and which has\nperiods of significant backflow, with a backwards flux equal to about 70\npercent of the maximum possible backflow, a dimensionless number $c_{bm}\n\\approx 0.04 $, discovered by Bracken and Melloy. This number has the unusual\nproperty of being independent of $\\hbar$ (and also of all other parameters of\nthe model), despite corresponding to a quantum-mechanical effect, and we shed\nsome light on this surprising property by considering the classical limit of\nbackflow. We conclude by discussing a specific measurement model in which\nbackflow may be identified in certain measurable probabilities.\n",
        "submitter": "James Yearsley",
        "authors": "J.M.Yearsley and J.J.Halliwell",
        "comments": "10 pages, 9 figures. To appear in proceedings of the 2012 DICE\n  Conference (edited by T.Elze)",
        "journal-ref": NaN,
        "doi": "10.1088/1742-6596/442/1/012055",
        "report-no": NaN,
        "categories": "quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-12",
        "authors_parsed": "Yearsley J. M.; Halliwell J. J."
    },
    {
        "id": "1301.6676",
        "title": "Inferring Parameters and Structure of Latent Variable Models by\n  Variational Bayes",
        "abstract": "  Current methods for learning graphical models with latent variables and a\nfixed structure estimate optimal values for the model parameters. Whereas this\napproach usually produces overfitting and suboptimal generalization\nperformance, carrying out the Bayesian program of computing the full posterior\ndistributions over the parameters remains a difficult problem. Moreover,\nlearning the structure of models with latent variables, for which the Bayesian\napproach is crucial, is yet a harder problem. In this paper I present the\nVariational Bayes framework, which provides a solution to these problems. This\napproach approximates full posterior distributions over model parameters and\nstructures, as well as latent variables, in an analytical manner without\nresorting to sampling methods. Unlike in the Laplace approximation, these\nposteriors are generally non-Gaussian and no Hessian needs to be computed. The\nresulting algorithm generalizes the standard Expectation Maximization\nalgorithm, and its convergence is guaranteed. I demonstrate that this algorithm\ncan be applied to a large class of models in several domains, including\nunsupervised clustering and blind source separation.\n",
        "submitter": "Hagai Attias",
        "authors": "Hagai Attias",
        "comments": "Appears in Proceedings of the Fifteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI1999)",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": "UAI-P-1999-PG-21-30",
        "categories": "cs.LG stat.ML",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-01-30",
        "authors_parsed": "Attias Hagai"
    },
    {
        "id": "1303.1326",
        "title": "Enumeration of RNA complexes via random matrix theory",
        "abstract": "  We review a derivation of the numbers of RNA complexes of an arbitrary\ntopology. These numbers are encoded in the free energy of the hermitian matrix\nmodel with potential V(x)=x^2/2-stx/(1-tx), where s and t are respective\ngenerating parameters for the number of RNA molecules and hydrogen bonds in a\ngiven complex. The free energies of this matrix model are computed using the\nso-called topological recursion, which is a powerful new formalism arising from\nrandom matrix theory. These numbers of RNA complexes also have profound meaning\nin mathematics: they provide the number of chord diagrams of fixed genus with\nspecified numbers of backbones and chords as well as the number of cells in\nRiemann's moduli spaces for bordered surfaces of fixed topological type.\n",
        "submitter": "Piotr Sulkowski",
        "authors": "J{\\o}rgen E. Andersen, Leonid O. Chekhov, R. C. Penner, Christian M.\n  Reidys, Piotr Su{\\l}kowski",
        "comments": "Proceedings of the conference \"Topological Aspects of DNA Function\n  and Protein Folding\", Isaac Newton Institute, Cambridge, 2012; 5 pages, 2\n  figures",
        "journal-ref": "Biochem. Soc. Trans. 41 (2013) 652",
        "doi": "10.1042/BST20120270",
        "report-no": "CALT-68-2896",
        "categories": "q-bio.QM cond-mat.soft hep-th math-ph math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2017-05-23",
        "authors_parsed": "Andersen Jørgen E.; Chekhov Leonid O.; Penner R. C.; Reidys Christian M.; Sułkowski Piotr"
    },
    {
        "id": "1312.0068",
        "title": "Universality in Gaussian Random Normal Matrices",
        "abstract": "  We prove that for Gaussian random normal matrices the correlation function\nhas universal behavior.\n  Using the technique of orthogonal polynomials and identities similar to the\nChristoffel-Darboux formula, we find that in the limit, as the dimension of the\nmatrix tends to infinity, the density of eigenvalues converges to a constant\ninside of an ellipse and to zero outside. The convergence holds locally\nuniformly. At the boundary, in scaled coordinates holding the distance between\neigenvalues constant, we show that the density is falling off to zero like the\ncomplementary error function. The convergence is uniform on the boundary.\nFurther we give an explicit expression for the the correlation function.\n",
        "submitter": "Roman Riser",
        "authors": "Roman Riser",
        "comments": "116 pages, 5 figures",
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "math-ph math.CA math.MP math.PR",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-12-03",
        "authors_parsed": "Riser Roman"
    },
    {
        "id": "1312.6751",
        "title": "A lagrangian description of elastic motion in riemannian manifolds and\n  an angular invariant of axially-symmetric elasticity tensors",
        "abstract": "  This article is a description of elasticity theory for readers with\nmathematical background. The first sections are an abridgment of parts of the\nbook by Marsden and Hughes, including a compact identification of the equations\nof motion as the Euler-Lagrange equations for the lagrangian density. The other\nsections describe the basic first-order classification of materials, from the\npoint of view of representation theory as opposed to index calculus. It\nincludes a computation of the axes of symmetry, when they exist, for most of\nthe irreducible components of the elasticity tensor. When the two components of\nthe 5-dimensional type $V_5$ have axes of symmetry, some invariants appear: 2\nangles in $S^{1}$ that measure the deviation of an associated decomposition\n$V_5\\otimes \\mathbb{R}^2=V_5\\oplus V_5$ from the standard one. See also the\nclassification appearing for example in (Chadwick, Vianello, and Cowin) and\n(Bona, Bucataru, and Slawinski) by symmetry group in $SO(3)$. A somewhat more\nrepresentation-theoretic approach can be found in (Itin and Hehl), and a\ncomplete list of polynomial invariants for generic elasticity tensors can be\nfound in (Boehler, Kirillov Jr, and Onat).\n",
        "submitter": "James Mathews",
        "authors": "James Mathews",
        "comments": NaN,
        "journal-ref": NaN,
        "doi": NaN,
        "report-no": NaN,
        "categories": "math-ph math.MP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2013-12-25",
        "authors_parsed": "Mathews James"
    },
    {
        "id": "1401.0963",
        "title": "Quantum Mechanics and the Principle of Least Radix Economy",
        "abstract": "  A new variational method, the principle of least radix economy, is\nformulated. The mathematical and physical relevance of the radix economy, also\ncalled digit capacity, is established, showing how physical laws can be derived\nfrom this concept in a unified way. The principle reinterprets and generalizes\nthe principle of least action yielding two classes of physical solutions: least\naction paths and quantum wavefunctions. A new physical foundation of the\nHilbert space of quantum mechanics is then accomplished and it is used to\nderive the Schr\\\"odinger and Dirac equations and the breaking of the\ncommutativity of spacetime geometry. The formulation provides an explanation of\nhow determinism and random statistical behavior coexist in spacetime and a\nframework is developed that allows dynamical processes to be formulated in\nterms of chains of digits. These methods lead to a new (pre-geometrical)\nfoundation for Lorentz transformations and special relativity. The\nParker-Rhodes combinatorial hierarchy is encompassed within our approach and\nthis leads to an estimate of the interaction strength of the electromagnetic\nand gravitational forces that agrees with the experimental values to an error\nof less than one thousandth. Finally, it is shown how the principle of\nleast-radix economy naturally gives rise to Boltzmann's principle of classical\nstatistical thermodynamics. A new expression for a general (path-dependent)\nnonequilibrium entropy is proposed satisfying the Second Law of Thermodynamics.\n",
        "submitter": "Vladimir Garcia-Morales",
        "authors": "Vladimir Garcia-Morales",
        "comments": "39 pages, 2 figures. Final version. Accepted to Foundations of\n  Physics (Springer)",
        "journal-ref": "Found. Phys. 45, 295 (2015)",
        "doi": "10.1007/s10701-015-9865-x",
        "report-no": NaN,
        "categories": "physics.gen-ph quant-ph",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-02-20",
        "authors_parsed": "Garcia-Morales Vladimir"
    },
    {
        "id": "1402.1542",
        "title": "One-dimensional Dirac operators with zero-range interactions: Spectral,\n  scattering, and topological results",
        "abstract": "  The spectral and scattering theory for 1-dimensional Dirac operators with\nmass $m$ and with zero-range interactions are fully investigated. Explicit\nexpressions for the wave operators and for the scattering operator are\nprovided. These new formulae take place in a representation which links, in a\nsuitable way, the energies $-\\infty$ and $+\\infty$, and which emphasizes the\nrole of $\\pm m$. Finally, a topological version of Levinson's theorem is\ndeduced, with the threshold effects at $\\pm m$ automatically taken into\naccount.\n",
        "submitter": "Serge Richard",
        "authors": "K. Pankrashkin, S. Richard",
        "comments": "18 pages",
        "journal-ref": NaN,
        "doi": "10.1063/1.4884417",
        "report-no": NaN,
        "categories": "math-ph math.MP math.SP",
        "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
        "update_date": "2015-06-18",
        "authors_parsed": "Pankrashkin K.; Richard S."
    }
]